[
    {
        "sectionName": "PART ONE--The Old Buccaneer",
        "subSection": [
            {
                "sectionName": "section1_1  title : 1 The Old Sea-dog at the Admiral Benbow",
                "summary": "The passage describes the arrival of an old seaman known as the captain at the Admiral Benbow inn, owned by the narrator's father. With an air of authority and a secretive demeanor, the captain takes up long-term residence, insisting on privacy and often singing sea songs while drinking rum. Intriguingly, he pays the narrator to watch for a seafaring man with one leg, a figure that haunts the narrator's dreams. Despite the captain's rough manners, intimidating stories, and occasional threats, the locals are oddly captivated by his presence. Dr. Livesey, a local doctor and magistrate, confronts the captain's misbehavior one evening, warning him to behave or face legal repercussions. The captain, while upset, does not retaliate and remains quiet afterwards.",
                "nodes": [
                    {
                        "id": "node_id0",
                        "label": "Jim Hawkins",
                        "title": "The narrator of the story, who recounts his adventure about Treasure Island",
                        "size": 30
                    },
                    {
                        "id": "node_id1",
                        "label": "Squire Trelawney",
                        "title": "A local gentleman who finances the voyage to Treasure Island",
                        "size": 27
                    },
                    {
                        "id": "node_id2",
                        "label": "Dr. Livesey",
                        "title": "A local doctor and magistrate; a level-headed leader of the expedition to Treasure Island",
                        "size": 28
                    },
                    {
                        "id": "node_id3",
                        "label": "Captain",
                        "title": "The anonymous old seaman who takes up lodging at the Admiral Benbow inn and has a mysterious past involving pirates",
                        "size": 29
                    },
                    {
                        "id": "node_id4",
                        "label": "Jim's father",
                        "title": "The keeper of the Admiral Benbow inn where the old seaman takes up lodging",
                        "size": 24
                    },
                    {
                        "id": "node_id5",
                        "label": "Man with the barrow",
                        "title": "The person who brings the captain's sea-chest to the Admiral Benbow inn",
                        "size": 22
                    },
                    {
                        "id": "node_id6",
                        "label": "Seafaring man with one leg",
                        "title": "A person the captain is on the lookout for, causing anxiety for Jim",
                        "size": 26
                    },
                    {
                        "id": "node_id7",
                        "label": "Old Taylor",
                        "title": "The gardener Dr. Livesey talks to in the parlour of the Admiral Benbow inn",
                        "size": 21
                    }
                ],
                "edges": [
                    {
                        "id": "edge_id0",
                        "label": "promise and haunt",
                        "title": "The seafaring man with one leg promised Jim Hawkins a silver fourpenny and haunted his dreams.",
                        "from": "node_id6",
                        "to": "node_id0",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id1",
                        "label": "command",
                        "title": "The Captain commanded Jim Hawkins to look out for a seafaring man with one leg.",
                        "from": "node_id3",
                        "to": "node_id0",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id2",
                        "label": "terrify",
                        "title": "The Captain terrified Jim's father.",
                        "from": "node_id3",
                        "to": "node_id4",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id3",
                        "label": "reprimand and warn",
                        "title": "Dr. Livesey reprimanded the Captain for his drinking and warned him he'd have an eye on him.",
                        "from": "node_id2",
                        "to": "node_id3",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id4",
                        "label": "respect",
                        "title": "The Captain showed respect to Dr. Livesey by not arguing back.",
                        "from": "node_id3",
                        "to": "node_id2",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    }
                ]
            },
            {
                "sectionName": "1_2 title : 2 Black Dog Appears and Disappears",
                "summary": "A mysterious stranger, missing two fingers and carrying a cutlass, arrives at an inn during a cold winter while the innkeeper's father's health is failing. The stranger, who has a sea-air but doesn’t seem completely sailor-like, asks for the captain, also known as Bill, who happens to be a guest at the inn, and begins a conversation with him over rum. The talk turns violent; they fight, and the stranger, named Black Dog, flees after being wounded by the captain. The captain then suffers a stroke and is treated by Doctor Livesey, who warns that continuing to drink rum could be fatal.",
                "nodes": [
                    {
                        "id": "node_id8",
                        "label": "Black Dog",
                        "title": "Mysterious and unscrupulous seafaring man with a sinister appearance",
                        "size": 26
                    },
                    {
                        "id": "node_id9",
                        "label": "Captain (Billy Bones)",
                        "title": "Old seafarer with a rough demeanor and a penchant for rum, associated with piracy",
                        "size": 27
                    },
                    {
                        "id": "node_id10",
                        "label": "Doctor Livesey",
                        "title": "Local authority figure and physician, viewed with respect and capable of handling emergencies",
                        "size": 26
                    },
                    {
                        "id": "node_id11",
                        "label": "Jim (Narrator)",
                        "title": "Young protagonist of the narrative, central figure in events and interactions",
                        "size": 28
                    },
                    {
                        "id": "node_id12",
                        "label": "Jim's Father",
                        "title": "Ailing parent of Jim, background character affecting Jim's responsibilities",
                        "size": 23
                    },
                    {
                        "id": "node_id13",
                        "label": "Jim's Mother",
                        "title": "Caretaker of the inn and Jim's father, involved in household matters",
                        "size": 24
                    }
                ],
                "edges": [
                    {
                        "id": "edge_id5",
                        "label": "past acquaintance",
                        "title": "Black Dog as ever was, come for to see his old shipmate Billy, at the Admiral Benbow inn.",
                        "from": "node_id9",
                        "to": "node_id8",
                        "arrows": "to"
                    },
                    {
                        "id": "edge_id6",
                        "label": "medical situation",
                        "title": "The man has had a stroke, as I warned him; One glass of rum won’t kill you, but if you take one you’ll take another and another.",
                        "from": "node_id9",
                        "to": "node_id10",
                        "arrows": "to"
                    },
                    {
                        "id": "edge_id7",
                        "label": "serving",
                        "title": "laying the breakfast-table against the captain’s return.",
                        "from": "node_id11",
                        "to": "node_id9",
                        "arrows": "to"
                    },
                    {
                        "id": "edge_id8",
                        "label": "interaction",
                        "title": "I told him he was out walking.",
                        "from": "node_id11",
                        "to": "node_id8",
                        "arrows": "to"
                    },
                    {
                        "id": "edge_id9",
                        "label": "patient",
                        "title": "Oh, doctor, we cried, what shall we do? Where is he wounded?",
                        "from": "node_id9",
                        "to": "node_id12",
                        "arrows": "to"
                    },
                    {
                        "id": "edge_id10",
                        "label": "causing concern",
                        "title": "Dear, deary me, cried my mother, what a disgrace upon the house!",
                        "from": "node_id9",
                        "to": "node_id13",
                        "arrows": "to"
                    }
                ]
            },
            {
                "sectionName": "1_3 title : 3 The Black Spot",
                "summary": "The ailing captain, in his final hours, pleads with young Jim for rum, offering a bribe and revealing his fears of being marked by the black spot—a pirate's death threat—because of a treasure known only to him. Despite health risks, Jim fetches the rum. The captain fears retribution from his old crew and makes Jim promise to warn the authorities if necessary. Later, a blind beggar arrives, coercing Jim to lead him to the captain, ultimately delivering the dreaded black spot before hastily departing. The captain, realizing his time is limited, attempts to rise but succumbs to a fatal apoplexy, leaving Jim with a sense of unexpected sorrow.",
                "nodes": [
                    {
                        "id": "node_id14",
                        "label": "Captain",
                        "title": "A sick and weakened pirate, fearing betrayal and conspiracies against him",
                        "size": 28
                    },
                    {
                        "id": "node_id15",
                        "label": "Jim",
                        "title": "A young boy who serves the Captain and becomes involved in the pirate's troubles",
                        "size": 29
                    },
                    {
                        "id": "node_id16",
                        "label": "Doctor",
                        "title": "The local physician who advises against the Captain's drinking but is cursed by him",
                        "size": 26
                    },
                    {
                        "id": "node_id17",
                        "label": "Black Dog",
                        "title": "A seafaring man with a bad reputation, possibly an old crewmate or enemy",
                        "size": 27
                    },
                    {
                        "id": "node_id18",
                        "label": "Blind Beggar",
                        "title": "A mysterious and menacing figure seeking the Captain",
                        "size": 28
                    },
                    {
                        "id": "node_id19",
                        "label": "Old Flint",
                        "title": "A deceased pirate captain mentioned in tales and memories",
                        "size": 24
                    },
                    {
                        "id": "node_id20",
                        "label": "Jim's Father",
                        "title": "Recently deceased, his death affects Jim and the running of the inn",
                        "size": 25
                    }
                ],
                "edges": [
                    {
                        "id": "edge_id11",
                        "label": "trust and reliance",
                        "title": "\"Jim,\" he said, \"you’re the only one here that’s worth anything,\" and \"and Jim, you’ll bring me one noggin of rum, now, won’t you, matey?\"",
                        "from": "node_id14",
                        "to": "node_id15",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id12",
                        "label": "contempt for",
                        "title": "\"and that doctor there, why, what do he know about seafaring men?\"",
                        "from": "node_id14",
                        "to": "node_id16",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id13",
                        "label": "concern for father’s condition & resistance to bribery",
                        "title": "\"He was growing more and more excited, and this alarmed me for my father, who was very low that day and needed quiet.\" & \"I want none of your money,\" said I, \"but what you owe my father.\"",
                        "from": "node_id15",
                        "to": "node_id14",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id14",
                        "label": "recognition of misdeed",
                        "title": "\"Ah! Black Dog,” says he. “He’s a bad ’un;\"",
                        "from": "node_id14",
                        "to": "node_id17",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id15",
                        "label": "deception and coercion",
                        "title": "\"the horrible, soft-spoken, eyeless creature gripped it in a moment like a vise.\"",
                        "from": "node_id18",
                        "to": "node_id15",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id16",
                        "label": "acquaintance",
                        "title": "\"Now, boy,” he said, “take me in to the captain.\"",
                        "from": "node_id18",
                        "to": "node_id14",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    }
                ]
            },
            {
                "sectionName": "1_4 title : 4 The Sea-chest",
                "summary": "A mother and her son, Jim, find themselves in a dangerous predicament after the death of a man owing them money, and with menacing characters like Black Dog and a blind beggar potentially posing a threat. They resolve to seek help and retrieve what's owed to them. Despite their bravery and the mother's impassioned speech to the villagers, no one assists them in defending their inn, the Admiral Benbow. Jim and his mother return to the inn alone, find the key on the dead man's body, and open his sea-chest to claim what is rightfully theirs. As they count the money, the scary blind man's tapping approaches but fades away, providing them the chance to flee. They escape with the money and a packet of papers from the chest but face the peril of being pursued as they head towards the hamlet. The mother, overcome with weakness, nearly collapses, and Jim helps her to hide under a bridge while they remain in danger.",
                "nodes": [
                    {
                        "id": "node_id21",
                        "label": "Jim",
                        "title": "The main character who narrates the story, shows courage and determination",
                        "size": 30
                    },
                    {
                        "id": "node_id22",
                        "label": "Mother",
                        "title": "Jim's mother, who is protective and brave in the face of danger",
                        "size": 28
                    },
                    {
                        "id": "node_id23",
                        "label": "Black Dog",
                        "title": "One of the pirates and a former shipmate of Captain Flint, represents a threat to Jim and his mother",
                        "size": 27
                    },
                    {
                        "id": "node_id24",
                        "label": "Blind beggar",
                        "title": "Another threatening figure for Jim and his mother, assumed to be a pirate",
                        "size": 27
                    },
                    {
                        "id": "node_id25",
                        "label": "Captain",
                        "title": "The deceased captain whose sea-chest and debts catalyze the events",
                        "size": 25
                    },
                    {
                        "id": "node_id26",
                        "label": "Doctor Livesey",
                        "title": "Person Jim and his mother aim to reach for help, a figure of authority and safety",
                        "size": 26
                    },
                    {
                        "id": "node_id27",
                        "label": "Mrs. Crossley",
                        "title": "A minor character mentioned in relation to a bag, has less importance in the plot",
                        "size": 22
                    },
                    {
                        "id": "node_id28",
                        "label": "Captain Flint",
                        "title": "A notorious pirate captain, though not present, his reputation casts a shadow over the events",
                        "size": 24
                    }
                ],
                "edges": [
                    {
                        "id": "edge_id17",
                        "label": "tell",
                        "title": "Jim told his mother all that he knew.",
                        "from": "node_id21",
                        "to": "node_id22",
                        "arrows": "to"
                    },
                    {
                        "id": "edge_id18",
                        "label": "order",
                        "title": "The captain ordered Jim to mount at once and ride for Doctor Livesey.",
                        "from": "node_id25",
                        "to": "node_id21",
                        "arrows": "to"
                    }
                ]
            },
            {
                "sectionName": "1_5 title : 5 The Last of the Blind Man",
                "summary": "A group of men, led by a blind man named Pew, arrived at the Admiral Benbow inn searching for a hidden chest. Despite their aggressive search, they found nothing; they had been beaten to it. As they quarreled amongst themselves, they were interrupted by approaching danger signaled by a whistle. The men scattered, leaving Pew behind, who was subsequently killed accidentally by a horse. The narrator, possibly in possession of what Pew's crew was searching for, decided to seek safety with the assistance of revenue officers who arrived, led by a supervisor named Dance. The inn was left in disarray from the search, and the narrator planned to report the events to Dr. Livesey with Mr. Dance's support.",
                "nodes": [
                    {
                        "id": "node_id29",
                        "label": "I",
                        "title": "The narrator of the story",
                        "size": 29
                    },
                    {
                        "id": "node_id30",
                        "label": "Blind man (Pew)",
                        "title": "The primary antagonist directing the assault",
                        "size": 28
                    },
                    {
                        "id": "node_id31",
                        "label": "Enemies",
                        "title": "The group of men arriving to attack, led by Pew",
                        "size": 27
                    },
                    {
                        "id": "node_id32",
                        "label": "Man with the lantern",
                        "title": "The person leading the enemies with illumination",
                        "size": 27
                    },
                    {
                        "id": "node_id33",
                        "label": "Three men",
                        "title": "Members of the attacking party, notably running hand in hand",
                        "size": 26
                    },
                    {
                        "id": "node_id34",
                        "label": "Lantern-bearer",
                        "title": "The person who follows the attackers into the Admiral Benbow",
                        "size": 26
                    },
                    {
                        "id": "node_id35",
                        "label": "Men of the house",
                        "title": "The defenders or inhabitants of the Admiral Benbow",
                        "size": 26
                    },
                    {
                        "id": "node_id36",
                        "label": "Bill",
                        "title": "A deceased character referenced in the attack",
                        "size": 25
                    },
                    {
                        "id": "node_id37",
                        "label": "Fellow from the window",
                        "title": "A person from within the house who communicates with Pew",
                        "size": 26
                    },
                    {
                        "id": "node_id38",
                        "label": "Man searching the captain's body",
                        "title": "One of Pew's crew looking for something on a body",
                        "size": 26
                    },
                    {
                        "id": "node_id39",
                        "label": "Dirk",
                        "title": "A person whose whistle is a signal to Pew's crew",
                        "size": 25
                    },
                    {
                        "id": "node_id40",
                        "label": "Fellow who had remained below",
                        "title": "The man giving updates about Bill being searched",
                        "size": 25
                    },
                    {
                        "id": "node_id41",
                        "label": "Johnny",
                        "title": "Black Dog, Names called by Pew, likely part of his crew",
                        "size": 25
                    },
                    {
                        "id": "node_id42",
                        "label": "Riders",
                        "title": "The group including a boy from the hamlet and revenue officers",
                        "size": 27
                    },
                    {
                        "id": "node_id43",
                        "label": "Boy from the hamlet",
                        "title": "A young character who joins the group of riders",
                        "size": 26
                    },
                    {
                        "id": "node_id44",
                        "label": "Revenue officers",
                        "title": "Officers riding with the boy from the hamlet",
                        "size": 26
                    },
                    {
                        "id": "node_id45",
                        "label": "Supervisor Dance",
                        "title": "An officer in charge who responds to the situation",
                        "size": 27
                    },
                    {
                        "id": "node_id46",
                        "label": "My mother",
                        "title": "The narrator's mother, involved in the events",
                        "size": 27
                    },
                    {
                        "id": "node_id47",
                        "label": "Dr. Livesey",
                        "title": "A gentleman and magistrate mentioned towards the end",
                        "size": 26
                    },
                    {
                        "id": "node_id48",
                        "label": "Dogger",
                        "title": "A person with a good horse who takes up the narrator",
                        "size": 25
                    },
                    {
                        "id": "node_id49",
                        "label": "Squire",
                        "title": "A person mentioned in connection with Dr. Livesey",
                        "size": 25
                    }
                ],
                "edges": [
                    {
                        "id": "edge_id19",
                        "label": "lead",
                        "title": "the middle man of this trio was the blind beggar.",
                        "from": "node_id30",
                        "to": "node_id33",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id20",
                        "label": "respond",
                        "title": "“Aye, aye, sir!” answered two or three.",
                        "from": "node_id35",
                        "to": "node_id30",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id21",
                        "label": "reprimand for delay",
                        "title": "the blind man again issued his commands.",
                        "from": "node_id30",
                        "to": "node_id35",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id22",
                        "label": "keep pace",
                        "title": "the lantern-bearer following.",
                        "from": "node_id30",
                        "to": "node_id32",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id23",
                        "label": "communicate",
                        "title": "a man leaned out into the moonlight... and addressed the blind beggar.",
                        "from": "node_id38",
                        "to": "node_id37",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id24",
                        "label": "inform",
                        "title": "“Pew,” he cried, “they’ve been before us. Someone’s turned the chest out alow and aloft.”",
                        "from": "node_id37",
                        "to": "node_id30",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id25",
                        "label": "question",
                        "title": "“Here, you below there, is it on Bill?” cried the blind man again.",
                        "from": "node_id30",
                        "to": "node_id39",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id26",
                        "label": "respond",
                        "title": "“Bill’s been overhauled a’ready,” said he; “nothin’ left.”",
                        "from": "node_id40",
                        "to": "node_id30",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id27",
                        "label": "alerted",
                        "title": "Some news of the lugger in Kitt’s Hole had found its way to Supervisor Dance.",
                        "from": "node_id44",
                        "to": "node_id45",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id28",
                        "label": "destination",
                        "title": "was a lad that had gone from the hamlet to Dr. Livesey’s.",
                        "from": "node_id47",
                        "to": "node_id43",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id29",
                        "label": "collide",
                        "title": "The rider tried to save him, but in vain.",
                        "from": "node_id42",
                        "to": "node_id30",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id30",
                        "label": "hail",
                        "title": "I leaped to my feet and hailed the riders.",
                        "from": "node_id29",
                        "to": "node_id42",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    }
                ]
            },
            {
                "sectionName": "1_6 title : 6 The Captain’s Papers",
                "summary": "Riding swiftly to Dr. Livesey's house, the group finds he's at the squire's hall. They hurry there and inform the squire and Dr. Livesey about the assailants at the inn and their search for Billy Bones' papers. Jim Hawkins presents the packet he retrieved, which contains a book and a map, possibly revealing the location of Captain Flint's treasure. Excited, the squire decides to finance a voyage to find the treasure, with Dr. Livesey as the ship’s doctor and Jim as the cabin boy, planning to keep the discovery secret as others are likely seeking the same fortune.",
                "nodes": [
                    {
                        "id": "node_id50",
                        "label": "Dr. Livesey",
                        "title": "A doctor and a friend of Squire Trelawney who is logical and composed, important in the discovery of the treasure map and organizing the voyage",
                        "size": 28
                    },
                    {
                        "id": "node_id51",
                        "label": "Squire Trelawney",
                        "title": "A wealthy landowner who finances the treasure expedition, eager and adventurous, central to funding and gathering a crew for the trip",
                        "size": 28
                    },
                    {
                        "id": "node_id52",
                        "label": "Mr. Dance",
                        "title": "A supervisor who recounts important narrative information, his actions and information are crucial to the plot though he is a minor character",
                        "size": 24
                    },
                    {
                        "id": "node_id53",
                        "label": "Jim Hawkins",
                        "title": "The protagonist and narrator of the story, a young boy who finds himself at the center of the treasure hunt",
                        "size": 30
                    },
                    {
                        "id": "node_id54",
                        "label": "The Captain",
                        "title": "Referred to as \"The Captain\" in this extract, one who held the treasure map and whose past actions and belongings instigate the treasure hunt",
                        "size": 27
                    },
                    {
                        "id": "node_id55",
                        "label": "Dogger",
                        "title": "A character assisting Jim with a stirrup, minor role in the story's events",
                        "size": 21
                    },
                    {
                        "id": "node_id56",
                        "label": "The maid",
                        "title": "A character who opens the door and informs about Dr. Livesey's whereabouts, minor role in the story's events",
                        "size": 21
                    },
                    {
                        "id": "node_id57",
                        "label": "Billy Bones",
                        "title": "Mentioned through his writings in the book, central to the backstory and treasure map's origins",
                        "size": 26
                    },
                    {
                        "id": "node_id58",
                        "label": "Blackbeard",
                        "title": "Referenced by the squire as a lesser buccaneer compared to Flint, contributes to the lore and reputation of pirates in the story",
                        "size": 22
                    },
                    {
                        "id": "node_id59",
                        "label": "Flint",
                        "title": "A feared and notorious pirate whose buried treasure is the story's main objective, though not present, his actions heavily influence the plot",
                        "size": 27
                    },
                    {
                        "id": "node_id60",
                        "label": "Redruth",
                        "title": "Joyce, Hunter, Included in Squire Trelawney's list of people to take on the treasure hunt, part of the crew that will support the expedition",
                        "size": 23
                    },
                    {
                        "id": "node_id61",
                        "label": "J.F.",
                        "title": "The initials written on the back of the treasure map, suggesting a link to the map's content, possibly related to Flint",
                        "size": 25
                    }
                ],
                "edges": [
                    {
                        "id": "edge_id31",
                        "label": "instruct and accompany",
                        "title": "Mr. Dance told me to jump down and knock, and taking me along with him, was admitted.",
                        "from": "node_id52",
                        "to": "node_id53",
                        "arrows": "to"
                    },
                    {
                        "id": "edge_id32",
                        "label": "question",
                        "title": "inquire, hand over, and offer protection, “And good evening to you, friend Jim. What good wind brings you here?”; “And so, Jim,” said the doctor, “you have the thing that they were after, have you?”; “Here it is, sir,” said I, and gave him the oilskin packet.; Jim and I shall stick together in the meanwhile.",
                        "from": "node_id50",
                        "to": "node_id53",
                        "arrows": "to"
                    }
                ]
            }
        ]
    },
    {
        "sectionName": "PART TWO--The Sea-cook",
        "subSection": [
            {
                "sectionName": "section2_1  title : 7 I Go to Bristol",
                "summary": "The preparations for setting sail took longer than expected, with Dr. Livesey having to go to London, the squire working hard in Bristol, and the narrator waiting at the hall, full of excitement about upcoming adventures at sea. Despite delays and difficulty finding a crew, Squire Trelawney secured the schooner Hispaniola in Bristol and engaged Long John Silver as the cook, who then helped recruit a capable crew. The squire sent a letter detailing these developments and urging Dr. Livesey to hurry to Bristol. The narrator shared the excitement caused by the letter and his mixed feelings upon leaving home for an adventurous journey at sea. The crew was ready, and they prepared to sail the following day.",
                "nodes": [
                    {
                        "id": "node_id62",
                        "label": "Dr. Livesey",
                        "title": "A physician and friend of the narrator who has to visit London",
                        "size": 23
                    },
                    {
                        "id": "node_id63",
                        "label": "Squire Trelawney",
                        "title": "A local squire involved in preparing for a sea voyage",
                        "size": 27
                    },
                    {
                        "id": "node_id64",
                        "label": "Old Redruth",
                        "title": "The gamekeeper in charge of the hall where the narrator stayed",
                        "size": 24
                    },
                    {
                        "id": "node_id65",
                        "label": "Tom Redruth",
                        "title": "Presumably the same individual as \"Old Redruth,\" a gamekeeper and a poor reader",
                        "size": 24
                    },
                    {
                        "id": "node_id66",
                        "label": "John Trelawney",
                        "title": "Presumably the same individual as \"Squire Trelawney,\" instrumental in acquiring the ship Hispaniola",
                        "size": 27
                    },
                    {
                        "id": "node_id67",
                        "label": "Long John Silver",
                        "title": "A one-legged ex-sailor turned cook hired for the ship",
                        "size": 28
                    },
                    {
                        "id": "node_id68",
                        "label": "Blandly",
                        "title": "An old friend of Squire Trelawney who helped acquire the ship Hispaniola",
                        "size": 26
                    },
                    {
                        "id": "node_id69",
                        "label": "Arrow",
                        "title": "A man recruited as a mate for the ship by Long John Silver",
                        "size": 25
                    },
                    {
                        "id": "node_id70",
                        "label": "Mrs. Hawkins",
                        "title": "The narrator's mother, taking care of the inn in the narrator's absence",
                        "size": 24
                    }
                ],
                "edges": [
                    {
                        "id": "edge_id33",
                        "label": "letter directive",
                        "title": "A letter addressed to Dr. Livesey with the order to be opened in his absence by Tom Redruth or young Hawkins.",
                        "from": "node_id62",
                        "to": "node_id65",
                        "arrows": "to"
                    },
                    {
                        "id": "edge_id34",
                        "label": "ship procurement connection",
                        "title": "I got her through my old friend, Blandly.",
                        "from": "node_id66",
                        "to": "node_id68",
                        "arrows": "to"
                    },
                    {
                        "id": "edge_id35",
                        "label": "crew recruitment connection",
                        "title": "Between Silver and myself we got together in a few days a company of the toughest old salts imaginable.",
                        "from": "node_id66",
                        "to": "node_id67",
                        "arrows": "to"
                    },
                    {
                        "id": "edge_id36",
                        "label": "mate recruitment",
                        "title": "Long John Silver unearthed a very competent man for a mate, a man named Arrow.",
                        "from": "node_id67",
                        "to": "node_id69",
                        "arrows": "to"
                    },
                    {
                        "id": "edge_id37",
                        "label": "instruction for travel to Bristol",
                        "title": "Let young Hawkins go at once to see his mother, with Redruth for a guard; and then both come full speed to Bristol.",
                        "from": "node_id63",
                        "to": "node_id64",
                        "arrows": "to"
                    },
                    {
                        "id": "edge_id38",
                        "label": "improvement of lifestyle",
                        "title": "He had found her a boy as an apprentice also so that she should not want help while I was gone.",
                        "from": "node_id63",
                        "to": "node_id70",
                        "arrows": "to"
                    }
                ]
            },
            {
                "sectionName": "2_2 title : 8 At the Sign of the Spy-glass",
                "summary": "A young boy, having finished breakfast, is given a note for John Silver and finds the Spy-glass tavern where seafaring men gather. John Silver, the one-legged, affable landlord, mistakes the boy for a new cabin-boy. When a patron identified as Black Dog flees without paying, Silver sends his men after him. Despite suspicions around Silver's possible pirate connections, the boy is convinced of his innocence. After sharing laughter, Silver and the boy head to meet the squire and Dr. Livesey, who are planning an inspection of a schooner. Silver recounts the events involving Black Dog truthfully, leaving a good impression on the gentlemen, and they all agree to meet aboard the ship later that day. The squire and the doctor express trust in Silver's character, and the boy is invited to join them to see the ship.",
                "nodes": [
                    {
                        "id": "node_id71",
                        "label": "Squire Trelawney",
                        "title": "A significant character referred by the narrator who provided a note addressed to John Silver",
                        "size": 26
                    },
                    {
                        "id": "node_id72",
                        "label": "John Silver",
                        "title": "Also known as Long John, a pivotal character who is the tavern keeper of the Spy-glass and is identified as the one-legged man and a buccaneer",
                        "size": 30
                    },
                    {
                        "id": "node_id73",
                        "label": "Harry",
                        "title": "A customer or acquaintance of John Silver who was instructed to chase Black Dog",
                        "size": 23
                    },
                    {
                        "id": "node_id74",
                        "label": "Black Dog",
                        "title": "A key figure from the narrator's past with the old Benbow and recognized as a buccaneer; he left the tavern without paying his score",
                        "size": 27
                    },
                    {
                        "id": "node_id75",
                        "label": "Morgan",
                        "title": "An old, grey-haired sailor also referred to by John Silver during the occurrence in the tavern",
                        "size": 24
                    },
                    {
                        "id": "node_id76",
                        "label": "Pew",
                        "title": "Mentioned as a blind man known to the narrator and associated with Black Dog and buccaneers",
                        "size": 25
                    },
                    {
                        "id": "node_id77",
                        "label": "Ben",
                        "title": "Indicated as someone tasked to aid Harry in pursuing Black Dog and praised for his running ability by John Silver",
                        "size": 23
                    },
                    {
                        "id": "node_id78",
                        "label": "Dr. Livesey",
                        "title": "A character who appeared at the end and conversed with squire about John Silver, recognizing his suitability",
                        "size": 26
                    },
                    {
                        "id": "node_id79",
                        "label": "Hawkins (Jim Hawkins)",
                        "title": "The primary narrator of the passage who interacts directly with John Silver and is involved in the events at the Spy-glass",
                        "size": 30
                    }
                ],
                "edges": [
                    {
                        "id": "edge_id39",
                        "label": "give a note and inform departure time",
                        "title": "The squire gave me a note addressed to John Silver and informed John Silver that all hands should be aboard by four in the afternoon.",
                        "from": "node_id71",
                        "to": "node_id72",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id40",
                        "label": "tell location and allow boarding",
                        "title": "Squire Trelawney told Hawkins he should easily find the sign of the Spy-glass by following the docks and agreed that Hawkins may come aboard the ship.",
                        "from": "node_id71",
                        "to": "node_id79",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id41",
                        "label": "identify",
                        "title": "deliver a message, and learn, Hawkins identified John Silver, delivered the squire's note, and learned about ships from John Silver.",
                        "from": "node_id79",
                        "to": "node_id72",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id42",
                        "label": "acknowledge",
                        "title": "inquire, confirm position, and justice with the squire, John Silver acknowledged his own name, inquired who Hawkins was, confirmed Hawkins as the new cabin-boy, and asked Hawkins to represent the incident justly to Squire Trelawney.",
                        "from": "node_id72",
                        "to": "node_id79",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id43",
                        "label": "agree on Silver's suitability",
                        "title": "Both Squire Trelawney and Dr. Livesey agreed that John Silver suits them.",
                        "from": "node_id71",
                        "to": "node_id78",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id44",
                        "label": "invite",
                        "title": "Dr. Livesey invited Hawkins to come aboard the ship.",
                        "from": "node_id78",
                        "to": "node_id79",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    }
                ]
            },
            {
                "sectionName": "2_3 title : 9 Powder and Arms",
                "summary": "The Hispaniola prepares for a voyage, but Captain Smollett is displeased with several aspects: his lack of control over choosing the crew, the nature of the secret treasure mission, and the conduct of his officer, Mr. Arrow. He confronts Squire Trelawney and Dr. Livesey about these issues and suggests strategic changes regarding the storage of arms and the crew's berths to prevent potential mutiny. The squire and the doctor agree to Smollett's recommendations, although Trelawney expresses disdain for the captain's manner. As weapons and supplies are being rearranged, Long John Silver makes his appearance. Smollett maintains strict discipline, showing no favoritism, which causes the narrator to dislike the captain.",
                "nodes": [
                    {
                        "id": "node_id80",
                        "label": "Mr. Arrow",
                        "title": "A brown old sailor with earrings in his ears, a squint, and the mate of the Hispaniola",
                        "size": 26
                    },
                    {
                        "id": "node_id81",
                        "label": "Captain Smollett",
                        "title": "The sharp-looking captain of the Hispaniola, who is unhappy with the cruise, the crew, and his officer Mr. Arrow",
                        "size": 29
                    },
                    {
                        "id": "node_id82",
                        "label": "Dr. Livesey",
                        "title": "A doctor who intervenes in the argument and requests clarification from Captain Smollett; he's also one of the organizers of the voyage",
                        "size": 28
                    },
                    {
                        "id": "node_id83",
                        "label": "Squire Trelawney",
                        "title": "The squire who is involved in organizing the voyage and seems to be naive about some details of the expedition",
                        "size": 28
                    },
                    {
                        "id": "node_id84",
                        "label": "Long John Silver",
                        "title": "Referred to by the squire and seems to have a reputation that divides opinion among the characters; his parrot is mentioned allegorically by Captain Smollett",
                        "size": 27
                    }
                ],
                "edges": [
                    {
                        "id": "edge_id45",
                        "label": "friendship",
                        "title": "He and the squire were very thick and friendly.",
                        "from": "node_id80",
                        "to": "node_id83",
                        "arrows": "to"
                    },
                    {
                        "id": "edge_id46",
                        "label": "interruption; concurrence; judgment of character",
                        "title": "But here Dr. Livesey cut in. “Far too much,” agreed the doctor. \"I believed you have managed to get two honest men on board with you--that man and John Silver.\"",
                        "from": "node_id83",
                        "to": "node_id82",
                        "arrows": "to"
                    },
                    {
                        "id": "edge_id47",
                        "label": "request for explanation; agreement; acknowledgment of secrecy; strategic planning",
                        "title": "I’m bound to say that I require an explanation of his words. “No,” said Dr. Livesey, “I don’t.” Now, treasure is ticklish work; I don’t like treasure voyages on any account, and I don’t like them, above all, when they are secret. \"You wish us to keep this matter dark and to make a garrison of the stern part of the ship, manned with my friend’s own people, and provided with all the arms and powder on board.\"",
                        "from": "node_id82",
                        "to": "node_id81",
                        "arrows": "to"
                    },
                    {
                        "id": "edge_id48",
                        "label": "evaluation",
                        "title": "I believe he’s a good seaman, but he’s too free with the crew to be a good officer.",
                        "from": "node_id81",
                        "to": "node_id80",
                        "arrows": "to"
                    },
                    {
                        "id": "edge_id49",
                        "label": "authority",
                        "title": "\"My orders!\" said the captain shortly. “You may go below, my man. Hands will want supper.\"",
                        "from": "node_id81",
                        "to": "node_id84",
                        "arrows": "to"
                    }
                ]
            },
            {
                "sectionName": "2_4 title : 10 The Voyage",
                "summary": "Preparations were made for a voyage with the squire's friends bidding farewell. After setting sail, the Hispaniola had a fairly good journey, though the first mate, Mr. Arrow, turned out to be a drunkard and eventually went overboard, leading to the promotion of the boatswain, Job Anderson. Long John Silver, the ship's cook, was well-respected and had a unique relationship with his parrot, which he called Cap'n Flint. Meanwhile, there was tension between the squire and Captain Smollett, who had doubts about the crew but liked the ship. Good spirits were maintained with treats like double grog and apples. Eventually, it became clear that an apple barrel on board was crucial for a warning about an act of treachery. As they neared their destination, the narrator hid in the nearly empty apple barrel and overheard Silver's conversation, realizing the fate of the crew rested on his shoulders.",
                "nodes": [
                    {
                        "id": "node_id85",
                        "label": "Squire",
                        "title": "A friend of the narrator who is wished a good voyage and safe return by his friends",
                        "size": 26
                    },
                    {
                        "id": "node_id86",
                        "label": "Mr. Blandly",
                        "title": "One of the squire’s friends who comes to wish him well",
                        "size": 24
                    },
                    {
                        "id": "node_id87",
                        "label": "Boatswain",
                        "title": "The crew member who signals the start of the voyage",
                        "size": 25
                    },
                    {
                        "id": "node_id88",
                        "label": "Barbecue (Long John Silver)",
                        "title": "The ship’s cook who is well-respected, called upon to sing, and eventually plays an essential role",
                        "size": 29
                    },
                    {
                        "id": "node_id89",
                        "label": "Captain",
                        "title": "Mentioned briefly in reference to past events at the Admiral Benbow and later as singing in the chorus",
                        "size": 26
                    },
                    {
                        "id": "node_id90",
                        "label": "Mr. Arrow",
                        "title": "The first mate who turns out to be a poor officer and falls overboard",
                        "size": 27
                    },
                    {
                        "id": "node_id91",
                        "label": "Job Anderson",
                        "title": "The boatswain who serves as the mate after Mr. Arrow’s disappearance",
                        "size": 26
                    },
                    {
                        "id": "node_id92",
                        "label": "Mr. Trelawney",
                        "title": "Has sea experience and takes watches, making him useful on board",
                        "size": 26
                    },
                    {
                        "id": "node_id93",
                        "label": "Israel Hands",
                        "title": "Coxswain and a trusted seaman, a confidant of Long John Silver",
                        "size": 27
                    },
                    {
                        "id": "node_id94",
                        "label": "Cap'n Flint (parrot)",
                        "title": "Long John Silver's parrot named after the famous buccaneer",
                        "size": 25
                    },
                    {
                        "id": "node_id95",
                        "label": "Captain Smollett",
                        "title": "The ship captain who has a terse relationship with the squire and runs the ship efficiently",
                        "size": 28
                    },
                    {
                        "id": "node_id96",
                        "label": "Dr. Livesey",
                        "title": "Mentioned as conversing with the captain about ship discipline, likely an important figure but not the main focus in this excerpt",
                        "size": 25
                    },
                    {
                        "id": "node_id97",
                        "label": "Narrator (Hawkins)",
                        "title": "The person recounting the story, whose actions and decisions are central to the plot",
                        "size": 30
                    }
                ],
                "edges": [
                    {
                        "id": "edge_id50",
                        "label": "bid farewell",
                        "title": "Mr. Blandly and other friends of the squire came off to wish him a good voyage and a safe return.",
                        "from": "node_id85",
                        "to": "node_id86",
                        "arrows": "to"
                    },
                    {
                        "id": "edge_id51",
                        "label": "commented on",
                        "title": "the captain commented that Mr. Arrow's disappearance saved them the trouble of putting him in irons.",
                        "from": "node_id89",
                        "to": "node_id90",
                        "arrows": "to"
                    },
                    {
                        "id": "edge_id52",
                        "label": "was despised by",
                        "title": "the squire despised Captain Smollett.",
                        "from": "node_id95",
                        "to": "node_id85",
                        "arrows": "to"
                    },
                    {
                        "id": "edge_id53",
                        "label": "was warned by",
                        "title": "the captain warned Dr. Livesey about spoiling the crew with treats.",
                        "from": "node_id96",
                        "to": "node_id89",
                        "arrows": "to"
                    }
                ]
            },
            {
                "sectionName": "2_5 title : 11 What I Heard in the Apple Barrel",
                "summary": "Long John Silver reminisces about his piracy days and his plans for future wealth, boasting to a young crew member about his cunning and strategy for survival. He emphasizes the importance of thrift and planning over recklessness. Silver displays confidence in his abilities and contemplates his retirement. The crew discusses their dissatisfaction with their current captain and their desire to claim their share of treasure. The group, which includes pirate cohorts like Israel Hands, plans to use the ship's officers to locate the treasure before turning on them. Throughout their conversation, they drink and toast to their past and future endeavors, unaware that they are being overheard by an eavesdropper hiding in a barrel, who learns of remaining loyal crew members and of the mutineers' intentions.",
                "nodes": [
                    {
                        "id": "node_id98",
                        "label": "Long John Silver",
                        "title": "A pirate with a timber leg who used to sail with Captain Flint and is now planning his own course",
                        "size": 29
                    },
                    {
                        "id": "node_id99",
                        "label": "Flint",
                        "title": "A notorious pirate captain, formerly the superior of Long John Silver",
                        "size": 28
                    },
                    {
                        "id": "node_id100",
                        "label": "Pew",
                        "title": "An old, blind pirate who lost his sight in the same battle Silver lost his leg; he wasted his money and died a beggar",
                        "size": 26
                    },
                    {
                        "id": "node_id101",
                        "label": "Youngest hand on board",
                        "title": "Admirer of Captain Flint's legend",
                        "size": 23
                    },
                    {
                        "id": "node_id102",
                        "label": "Master surgeon",
                        "title": "The one who amputated Silver's leg and had an unfortunate end",
                        "size": 24
                    },
                    {
                        "id": "node_id103",
                        "label": "Roberts",
                        "title": "Leader of a group of men who had a practice of changing the names of their ships, indirectly relating to the story Silver tells",
                        "size": 24
                    },
                    {
                        "id": "node_id104",
                        "label": "Davis",
                        "title": "Another pirate mentioned by Silver, though he never sailed with him",
                        "size": 23
                    },
                    {
                        "id": "node_id105",
                        "label": "Spy-glass",
                        "title": "Personified as Silver's \"old missis\" but since it is not specified as a character, it's likely a name of a ship or tavern",
                        "size": 20
                    },
                    {
                        "id": "node_id106",
                        "label": "Dick",
                        "title": "A young sailor who is being corrupted into piracy, and is trusted by Silver",
                        "size": 25
                    },
                    {
                        "id": "node_id107",
                        "label": "Israel Hands",
                        "title": "The coxswain, who engages in conversation with Silver and also trusts Dick",
                        "size": 26
                    },
                    {
                        "id": "node_id108",
                        "label": "Cap'n Smollett",
                        "title": "Captain of the ship valued by Silver for his seamanship, not present in the conversation but referenced by the characters",
                        "size": 27
                    },
                    {
                        "id": "node_id109",
                        "label": "The squire and doctor with a map",
                        "title": "Not directly involved in the conversation, but their possession of the map makes them important",
                        "size": 26
                    },
                    {
                        "id": "node_id110",
                        "label": "Billy Bones",
                        "title": "A deceased pirate known for his ruthlessness, mentioned in passing",
                        "size": 24
                    },
                    {
                        "id": "node_id111",
                        "label": "Gentleman of fortune",
                        "title": "A term used by pirates such as Silver to describe themselves, which refers to pirates in general, not a specific character",
                        "size": 20
                    },
                    {
                        "id": "node_id112",
                        "label": "Trelawney",
                        "title": "A character Silver claims to have a personal vendetta against and plans to harm",
                        "size": 25
                    },
                    {
                        "id": "node_id113",
                        "label": "Mr. Arrow",
                        "title": "A character not part of this conversation, known to Silver, who suffered from drinking too much",
                        "size": 23
                    }
                ],
                "edges": []
            },
            {
                "sectionName": "2_6 title : 12 Council of War",
                "summary": "Aboard the ship Hispaniola, there is sudden activity as the crew prepares for an impending encounter. Captain Smollett strategically maneuvers the ship near Skeleton Island, previously known for pirates, while questioning the crew about their knowledge of the land. Long John Silver openly shares his familiarity with the island, fooling Captain Smollett with a copied but incomplete map. Afterward, Silver privately, but menacingly, confides in Jim Hawkins about his experiences on the island, leaving Jim uneasy. Jim then desperately seeks to share with the captain and his allies critical information he has overheard about Silver's treacherous intentions. With this knowledge, the captain acknowledges they're surrounded by an untrustworthy crew, likely planning a mutiny. They decide to maintain control and keep watch until they can identify their loyal crew members and act preemptively. Out of the twenty-six crew, only seven are deemed trustworthy, including Jim, whose observant nature is seen as an asset.",
                "nodes": [
                    {
                        "id": "node_id114",
                        "label": "Jim Hawkins",
                        "title": "The protagonist who overhears the pirates' plans and shares the intelligence with his allies",
                        "size": 30
                    },
                    {
                        "id": "node_id115",
                        "label": "Captain Smollett",
                        "title": "The captain of the HISPANIOLA who leads his men and plots to maintain order amidst thoughts of mutiny",
                        "size": 29
                    },
                    {
                        "id": "node_id116",
                        "label": "Dr. Livesey",
                        "title": "A doctor and one of the leaders among the protagonist's group, contributing to their strategies and decision making",
                        "size": 28
                    },
                    {
                        "id": "node_id117",
                        "label": "Long John Silver",
                        "title": "A cunning and duplicitous pirate posing as a ship's cook, central to the unfolding mutiny and conflict",
                        "size": 29
                    },
                    {
                        "id": "node_id118",
                        "label": "Mr. Trelawney",
                        "title": "A gentleman of means who finances the voyage, a key decision-maker among the protagonist's group",
                        "size": 27
                    },
                    {
                        "id": "node_id119",
                        "label": "Hunter",
                        "title": "A member of the protagonist's crew, present during the rush to the weather bow",
                        "size": 24
                    },
                    {
                        "id": "node_id120",
                        "label": "Job Anderson",
                        "title": "A member of the ship's crew, receives orders from Captain Smollett",
                        "size": 24
                    },
                    {
                        "id": "node_id121",
                        "label": "Squire",
                        "title": "Presumably Mr. Trelawney, who participates in decisions regarding the management of the ship and the journey",
                        "size": 20
                    }
                ],
                "edges": [
                    {
                        "id": "edge_id54",
                        "label": "rush together",
                        "title": "Jim Hawkins joined Hunter and Dr. Livesey in the rush for the weather bow.",
                        "from": "node_id114",
                        "to": "node_id119",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id55",
                        "label": "rush together & communicates news",
                        "title": "Jim Hawkins joined Hunter and Dr. Livesey in the rush for the weather bow. & Jim Hawkins communicated Silver's conversation to Dr. Livesey.",
                        "from": "node_id114",
                        "to": "node_id116",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id56",
                        "label": "provides information & initiates cheer",
                        "title": "Long John Silver informed Captain Smollett about the island's landmarks and anchorage. & Long John Silver initiated a cheer for Captain Smollett.",
                        "from": "node_id117",
                        "to": "node_id115",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id57",
                        "label": "requests assistance",
                        "title": "Captain Smollett asked Long John Silver to lend help later.",
                        "from": "node_id115",
                        "to": "node_id117",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id58",
                        "label": "offers exploration advice",
                        "title": "Long John Silver offered Jim Hawkins to put up a snack for him to take along when exploring.",
                        "from": "node_id117",
                        "to": "node_id114",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id59",
                        "label": "converses with",
                        "title": "Captain Smollett was talking with the squire and Dr. Livesey on the quarter-deck.",
                        "from": "node_id115",
                        "to": "node_id121",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id60",
                        "label": "converses with & plans strategy",
                        "title": "Captain Smollett was talking with the squire and Dr. Livesey on the quarter-deck. & Captain Smollett planned a strategy with Dr. Livesey and Mr. Trelawney regarding the crew and situation ahead.",
                        "from": "node_id115",
                        "to": "node_id116",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id61",
                        "label": "summons",
                        "title": "Dr. Livesey called Jim Hawkins to his side to fetch his pipe.",
                        "from": "node_id116",
                        "to": "node_id114",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id62",
                        "label": "gives orders",
                        "title": "Captain Smollett gave an order to Job Anderson.",
                        "from": "node_id115",
                        "to": "node_id120",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id63",
                        "label": "communicates news",
                        "title": "Jim Hawkins communicated Silver's conversation to Captain Smollett.",
                        "from": "node_id114",
                        "to": "node_id115",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id64",
                        "label": "communicates news",
                        "title": "Jim Hawkins communicated Silver's conversation to the Squire.",
                        "from": "node_id114",
                        "to": "node_id121",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id65",
                        "label": "plans strategy",
                        "title": "Captain Smollett planned a strategy with Mr. Trelawney and Dr. Livesey regarding the crew and situation ahead.",
                        "from": "node_id115",
                        "to": "node_id118",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id66",
                        "label": "evaluates Silver",
                        "title": "Dr. Livesey remarked on Silver's character to Captain Smollett.",
                        "from": "node_id116",
                        "to": "node_id115",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    }
                ]
            }
        ]
    },
    {
        "sectionName": "PART THREE--My Shore Adventure",
        "subSection": [
            {
                "sectionName": "section3_1  title : 13 How My Shore Adventure Began",
                "summary": "My Shore Adventure began with a changed island landscape and calm weather. Despite being a seasoned sailor, I felt uneasy on the still ship and disliked the island's dreary appearance. We had to warp the HISPANIOLA around the island without wind, in sweltering heat with discontent growing among the crew. As we anchored, the ominous presence of fever and potential mutiny loomed. The captain's plan was to let the crew ashore, hoping to quell their unrest. Armed and wary, the crew's morale briefly lifted at the promise of shore leave. With the crew divided, I impulsively stowed away on a boat headed to shore, evading notice until too late. Landing amidst the woods, I fled into the foliage, leaving Silver calling after me.",
                "nodes": [
                    {
                        "id": "node_id122",
                        "label": "Jim",
                        "title": "The first-person narrator and one of the main characters of the story",
                        "size": 30
                    },
                    {
                        "id": "node_id123",
                        "label": "Anderson",
                        "title": "A member of the ship's crew in command of the narrator's boat",
                        "size": 24
                    },
                    {
                        "id": "node_id124",
                        "label": "Long John (Silver)",
                        "title": "A cunning and strategic one-legged pirate and the main antagonist",
                        "size": 29
                    },
                    {
                        "id": "node_id125",
                        "label": "The doctor",
                        "title": "A ship's officer, likely the ship's surgeon, who remarks about the possibility of disease on the island",
                        "size": 25
                    },
                    {
                        "id": "node_id126",
                        "label": "The captain",
                        "title": "The leader of the honest crew on the ship, devising strategies to counter the threat of mutiny",
                        "size": 28
                    },
                    {
                        "id": "node_id127",
                        "label": "The squire",
                        "title": "Another officer or gentleman on board who is involved in the decision-making process with the captain",
                        "size": 26
                    },
                    {
                        "id": "node_id128",
                        "label": "Hunter",
                        "title": "Joyce, and Redruth, Mentioned as 'sure men', part of the trustworthy group of the ship's crew",
                        "size": 25
                    },
                    {
                        "id": "node_id129",
                        "label": "The honest hands",
                        "title": "Crew members who are loyal and not part of the mutiny",
                        "size": 23
                    }
                ],
                "edges": []
            },
            {
                "sectionName": "3_2 title : 14 The First Blow",
                "summary": "After successfully evading Long John Silver, the narrator finds joy in exploring the uninhabited island. Hearing some of his shipmates approaching by a marsh, he hides and eavesdrops on Silver conversing with another crew member, Tom. Silver tries to convince Tom of his loyalty, but they are interrupted by a distant scream. A confrontation ensues, and Silver kills Tom following an altercation over a perceived betrayal. The narrator, witnessing the murder, flees in fear, aware that discovery could mean his own death at the hands of the mutineers. As he runs, the narrator contemplates his grim options—starvation or being killed by the crew.",
                "nodes": [
                    {
                        "id": "node_id130",
                        "label": "Long John Silver",
                        "title": "A pirate who is involved in a heated and earnest conversation with another crew member, possibly regarding mutiny or treasure",
                        "size": 29
                    },
                    {
                        "id": "node_id131",
                        "label": "Tom",
                        "title": "Another crew member who confronts Silver and is ultimately killed by him for what he sees as a betrayal",
                        "size": 28
                    },
                    {
                        "id": "node_id132",
                        "label": "Alan",
                        "title": "The person who is presumed dead by Tom, believed to be killed by Silver",
                        "size": 26
                    },
                    {
                        "id": "node_id133",
                        "label": "The unnamed narrator of the story",
                        "title": "An observer of the events, who is exploring the island and witnesses the conversation and subsequent murder by Silver",
                        "size": 29
                    },
                    {
                        "id": "node_id134",
                        "label": "The crew (collectively)",
                        "title": "Likely involved in the events the narrator is witnessing and may include the voices and the people the narrator fears will discover them",
                        "size": 27
                    }
                ],
                "edges": [
                    {
                        "id": "edge_id67",
                        "label": "murder",
                        "title": "Silver, agile as a monkey even without leg or crutch, was on the top of him next moment and had twice buried his knife up to the hilt in that defenceless body.",
                        "from": "node_id130",
                        "to": "node_id131",
                        "arrows": "to"
                    }
                ]
            },
            {
                "sectionName": "3_3 title : 15 The Man of the Island",
                "summary": "While traversing a stony area, the narrator observes a mysterious figure and initially opts for known dangers over the uncertain threat of this stranger. This figure turns out to be a man named Ben Gunn, isolated for three years after being marooned. Ben Gunn longs for a return to civilization and Christian fellowship, as well as for cheese. He expresses a peculiar mix of madness, piety, and slyness, revealing to the narrator that he knows the location of Captain Flint's treasure. Ben Gunn had been part of Flint's crew and witnessed the hiding of the treasure. He offers to ally with the narrator, showing interest in securing a share of the treasure and safe passage home. Their conversation is interrupted by the sound of gunfire, signaling that a conflict has begun, and they hurry toward the action.",
                "nodes": [
                    {
                        "id": "node_id135",
                        "label": "Ben Gunn",
                        "title": "A marooned man who lived alone on the island for three years and knows about Flint's treasure",
                        "size": 30
                    },
                    {
                        "id": "node_id136",
                        "label": "Jim",
                        "title": "The protagonist and narrator of the story who interacts with Ben Gunn",
                        "size": 30
                    },
                    {
                        "id": "node_id137",
                        "label": "Silver (Long John Silver)",
                        "title": "A one-legged cook and ringleader of mutineers, central to Jim's fears",
                        "size": 28
                    },
                    {
                        "id": "node_id138",
                        "label": "Flint",
                        "title": "A deceased pirate and former owner of the treasure, important to the backstory and central to the plot",
                        "size": 27
                    },
                    {
                        "id": "node_id139",
                        "label": "Billy Bones",
                        "title": "The former mate of Flint mentioned in Ben Gunn's story, plays a role in the backstory",
                        "size": 24
                    },
                    {
                        "id": "node_id140",
                        "label": "Squire",
                        "title": "A character Jim mentions as liberal and potentially helpful, not directly interacting in the passage",
                        "size": 25
                    }
                ],
                "edges": [
                    {
                        "id": "edge_id68",
                        "label": "meet",
                        "title": "Jim meets Ben Gunn, who introduces himself and explains that he has not spoken with a Christian for three years.",
                        "from": "node_id135",
                        "to": "node_id136",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id69",
                        "label": "offer",
                        "title": "Jim offers Ben Gunn cheese if he can get back aboard his ship.",
                        "from": "node_id136",
                        "to": "node_id135",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id70",
                        "label": "serve",
                        "title": "Ben Gunn served under Long John Silver when Flint buried the treasure.",
                        "from": "node_id135",
                        "to": "node_id137",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    }
                ]
            }
        ]
    },
    {
        "sectionName": "PART FOUR--The Stockade",
        "subSection": [
            {
                "sectionName": "section4_1  title : 16 Narrative Continued by the Doctor: How the Ship Was Abandoned",
                "summary": "The doctor continued narrating how their ship, the HISPANIOLA, was abandoned. At approximately 1:30 pm, they considered attacking the mutineers on board due to their diminished number. However, they lacked wind for maneuvering and learned Jim Hawkins had gone ashore. Concerned for Jim's safety, the doctor and Hunter took a boat to shore for reconnaissance. They stealthily approached the stockade—a fortified log house with a strategic water spring—and returned to the ship to devise a plan to transport supplies to the stockade. They successfully moved firearms, food, and the doctor's medicine chest to the stockade, making multiple trips despite risks from the shore. The doctor returned to the ship for the last time, with the squire waiting to load more supplies. They discarded unnecessary weapons overboard and prepared to leave. As they were leaving, Captain Smollett convinced one of the mutineers, Abraham Gray, to join them. They then departed the ship for their fortified position.",
                "nodes": [
                    {
                        "id": "node_id141",
                        "label": "Doctor",
                        "title": "A ship's doctor involved in the narrative and decisions about the ship's safety",
                        "size": 28
                    },
                    {
                        "id": "node_id142",
                        "label": "Hunter",
                        "title": "A crew member who accompanies the doctor to shore",
                        "size": 26
                    },
                    {
                        "id": "node_id143",
                        "label": "Jim Hawkins",
                        "title": "A young protagonist who slips away onto the shore, prompting concern for his safety",
                        "size": 28
                    },
                    {
                        "id": "node_id144",
                        "label": "Captain",
                        "title": "The leader of the expedition who participates in the planning and execution of tactical decisions",
                        "size": 28
                    },
                    {
                        "id": "node_id145",
                        "label": "Squire",
                        "title": "A character involved in the cabin discussions and concerned about the consequences",
                        "size": 27
                    },
                    {
                        "id": "node_id146",
                        "label": "Redruth",
                        "title": "A character assigned to the gallery with muskets, presumably for defense",
                        "size": 25
                    },
                    {
                        "id": "node_id147",
                        "label": "Joyce",
                        "title": "A character left to guard stores while others transport supplies",
                        "size": 25
                    },
                    {
                        "id": "node_id148",
                        "label": "Mr. Hands (Coxswain)",
                        "title": "The principal man aboard the ship, engaging with the captain in a tense standoff",
                        "size": 26
                    },
                    {
                        "id": "node_id149",
                        "label": "Abraham Gray",
                        "title": "A character who initially does not respond but eventually joins the captain and allies, demonstrating a shift in loyalty or conscience",
                        "size": 27
                    }
                ],
                "edges": [
                    {
                        "id": "edge_id71",
                        "label": "concern for safety",
                        "title": "The Doctor expressed concern for Jim Hawkins' safety when he went ashore with the rest.",
                        "from": "node_id141",
                        "to": "node_id143",
                        "arrows": "to"
                    },
                    {
                        "id": "edge_id72",
                        "label": "command",
                        "title": "The Captain commanded Mr. Hands (Coxswain) that if anyone made a signal, they would be shot.",
                        "from": "node_id144",
                        "to": "node_id148",
                        "arrows": "to"
                    }
                ]
            },
            {
                "sectionName": "4_2 title : 17 Narrative Continued by the Doctor: The Jolly-boat’s Last Trip",
                "summary": "The overburdened jolly-boat, carrying five men and supplies, faced peril from an ebbing tide that took them off course. The captain directed the crew to correct their imbalance, as they navigated a tricky current away from nearby pirates. Steering proved difficult, and they had to avoid coming ashore too close to the enemy or risk getting swept past their landing point. During their escape, they realized the pirates could potentially use a long gun left onshore against them. As they approached safety, they narrowly avoided gunfire from the hostile crew and were forced to act quickly as the opposing gigs closed in. Despite making headway, their boat sank gently in shallow water due to an ill-timed shot, causing them to lose most of their supplies but sparing their lives. Voices nearby signaled further danger as they contemplated the defense capabilities of their comrades at the stockade, and they hastened to wade ashore amidst these threats.",
                "nodes": [
                    {
                        "id": "node_id150",
                        "label": "Trelawney",
                        "title": "A grown man who is over six feet tall and participates in the boat trip",
                        "size": 27
                    },
                    {
                        "id": "node_id151",
                        "label": "Redruth",
                        "title": "A grown man over six feet tall accompanying Trelawney and the captain on the boat trip",
                        "size": 27
                    },
                    {
                        "id": "node_id152",
                        "label": "Captain",
                        "title": "A key figure on the boat trip, giving orders, and participating in critical decisions",
                        "size": 29
                    },
                    {
                        "id": "node_id153",
                        "label": "Doctor (Narrator)",
                        "title": "The person recounting the events of the boat trip and actively involved in the actions",
                        "size": 30
                    },
                    {
                        "id": "node_id154",
                        "label": "Gray",
                        "title": "A man sitting in the fore-sheets of the boat, providing observations about the current",
                        "size": 26
                    },
                    {
                        "id": "node_id155",
                        "label": "Israel Hands",
                        "title": "The brandy-faced rascal aboard the HISPANIOLA, involved in the action around the long gun",
                        "size": 28
                    },
                    {
                        "id": "node_id156",
                        "label": "Mr. Trelawney (Squire)",
                        "title": "Identified by the narrator as the best shot and asked by the captain to pick off one of the men with a gun",
                        "size": 29
                    },
                    {
                        "id": "node_id157",
                        "label": "Hunter",
                        "title": "Mentioned in context of whether he would stand firm if attacked; his steadiness is known",
                        "size": 25
                    },
                    {
                        "id": "node_id158",
                        "label": "Joyce",
                        "title": "Mentioned as a doubtful case in terms of combat readiness; pleasant and polite but not seen as entirely suited for battle",
                        "size": 25
                    }
                ],
                "edges": []
            },
            {
                "sectionName": "4_3 title : 18 Narrative Continued by the Doctor: End of the First Day’s Fighting",
                "summary": "The group advances towards the stockade but encounters mutineers, leading to a skirmish in which one enemy is killed and Tom Redruth, a member of the group, is fatally wounded. After celebrating their victory, the group faces another attack but manages to fend it off. They hoist the British flag, but the mutineers continue to bombard them without success. Despite the ongoing assault, the group is able to acknowledge Redruth's bravery before he passes away. The captain takes stock of their supplies and notes that they're low. Meanwhile, Silver and the mutineers steal their supplies, leaving the group with limited provisions. Suddenly, Jim Hawkins appears, having safely returned to the group.",
                "nodes": [
                    {
                        "id": "node_id159",
                        "label": "Doctor Livesey",
                        "title": "Ship's doctor and one of the protagonists",
                        "size": 28
                    },
                    {
                        "id": "node_id160",
                        "label": "Squire Trelawney",
                        "title": "Owner of the expedition and one of the protagonists",
                        "size": 27
                    },
                    {
                        "id": "node_id161",
                        "label": "Captain Smollett",
                        "title": "Master of the ship and one of the protagonists",
                        "size": 28
                    },
                    {
                        "id": "node_id162",
                        "label": "Abraham Gray",
                        "title": "Carpenter's mate and ally of the protagonists",
                        "size": 26
                    },
                    {
                        "id": "node_id163",
                        "label": "John Hunter",
                        "title": "Owner's servant and ally of the protagonists",
                        "size": 25
                    },
                    {
                        "id": "node_id164",
                        "label": "Richard Joyce",
                        "title": "Owner's servant and ally of the protagonists",
                        "size": 25
                    },
                    {
                        "id": "node_id165",
                        "label": "Job Anderson",
                        "title": "Boatswain and leading the mutineers",
                        "size": 27
                    },
                    {
                        "id": "node_id166",
                        "label": "Tom Redruth",
                        "title": "Owner's servant and one of the first victims in the conflict",
                        "size": 26
                    },
                    {
                        "id": "node_id167",
                        "label": "Jim Hawkins",
                        "title": "Cabin-boy and the story's young protagonist",
                        "size": 28
                    },
                    {
                        "id": "node_id168",
                        "label": "Silver",
                        "title": "Mutineer and key antagonist",
                        "size": 28
                    }
                ],
                "edges": [
                    {
                        "id": "edge_id73",
                        "label": "exchange guns & suggest lowering flag",
                        "title": "Trelawney and Captain Smollett exchanged their guns on Doctor Livesey's advice. & Squire Trelawney suggested to Captain Smollett to take down the flag to avoid being a target.",
                        "from": "node_id160",
                        "to": "node_id161",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id74",
                        "label": "forgive",
                        "title": "Squire Trelawney forgives Tom Redruth and is upset by his impending death.",
                        "from": "node_id160",
                        "to": "node_id166",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id75",
                        "label": "cover with flag",
                        "title": "Captain Smollett covered Tom Redruth's body with a flag as a sign of respect.",
                        "from": "node_id161",
                        "to": "node_id166",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id76",
                        "label": "discuss provisions",
                        "title": "Captain Smollett discussed the status of their provisions with Doctor Livesey.",
                        "from": "node_id161",
                        "to": "node_id159",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id77",
                        "label": "report status",
                        "title": "Captain Smollett informed Squire Trelawney about the dwindling stores and their situation.",
                        "from": "node_id161",
                        "to": "node_id160",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    }
                ]
            },
            {
                "sectionName": "4_4 title : 19 Narrative Resumed by Jim Hawkins: The Garrison in the Stockade",
                "summary": "Ben Gunn and Jim Hawkins discuss the likelihood of their friends being at a nearby stockade. They part ways when cannon fire begins. Jim hides, observing activity around the anchored ship Hispaniola, recognizing the pirate flag. He considers Ben Gunn's hints about a boat's location. Returning to the stockate, Jim finds his group managing after the attack, burying a comrade, and strategizing for survival against the pirates' superior numbers. They hope to outlast the pirates with the help of rum and disease as allies. Later, a flag of truce appears, and to Jim's shock, Silver himself arrives.",
                "nodes": [
                    {
                        "id": "node_id169",
                        "label": "Jim Hawkins",
                        "title": "The story's protagonist and narrator",
                        "size": 30
                    },
                    {
                        "id": "node_id170",
                        "label": "Ben Gunn",
                        "title": "A marooned sailor who provides crucial information to Jim",
                        "size": 28
                    },
                    {
                        "id": "node_id171",
                        "label": "Silver",
                        "title": "A pirate leader whom Ben Gunn references as genteel",
                        "size": 29
                    },
                    {
                        "id": "node_id172",
                        "label": "Captain Smollett",
                        "title": "The captain of Jim's group, authoritative and practical",
                        "size": 28
                    },
                    {
                        "id": "node_id173",
                        "label": "Doctor (Dr. Livesey)",
                        "title": "A sensible and brave gentleman who serves as a leader and medic",
                        "size": 28
                    },
                    {
                        "id": "node_id174",
                        "label": "Squire (Squire Trelawney)",
                        "title": "A companion of Jim's group, perhaps the one Ben Gunn wishes to speak to",
                        "size": 27
                    },
                    {
                        "id": "node_id175",
                        "label": "Gray",
                        "title": "A new member of Captain Smollett's group with a bandaged face",
                        "size": 25
                    },
                    {
                        "id": "node_id176",
                        "label": "Tom Redruth",
                        "title": "A deceased member of Captain Smollett's group",
                        "size": 23
                    },
                    {
                        "id": "node_id177",
                        "label": "Hunter",
                        "title": "A member of Captain Smollett's watch group",
                        "size": 24
                    },
                    {
                        "id": "node_id178",
                        "label": "Joyce",
                        "title": "A member of Captain Smollett's watch group",
                        "size": 24
                    },
                    {
                        "id": "node_id179",
                        "label": "Flint",
                        "title": "A notorious pirate referenced by Ben Gunn, not directly involved in the present action",
                        "size": 23
                    }
                ],
                "edges": [
                    {
                        "id": "edge_id78",
                        "label": "pinch",
                        "title": "Ben Gunn pinched Jim Hawkins for the third time.",
                        "from": "node_id170",
                        "to": "node_id169",
                        "arrows": "to"
                    }
                ]
            },
            {
                "sectionName": "4_5 title : 20 Silver’s Embassy",
                "summary": "John Silver, accompanied by another man, approaches the stockade under a flag of truce to negotiate with Captain Smollett. Despite the cold and damp morning, Silver is confident and attempts to make terms for his safe departure and a share of treasure, but the captain steadfastly refuses any discussion, insisting on bringing the mutineers to justice. The tension is palpable, with both sides aware of the other's capabilities and intentions. Silver, rebuffed and angry, threatens retaliation before he is assisted back over the stockade, leaving the captain and his loyal crew prepared to defend themselves.",
                "nodes": [
                    {
                        "id": "node_id180",
                        "label": "Silver",
                        "title": "A pirate and mutineer who is negotiating terms of surrender with the captain",
                        "size": 29
                    },
                    {
                        "id": "node_id181",
                        "label": "Captain",
                        "title": "The leader of the protagonists who is handling negotiations with the pirates",
                        "size": 29
                    },
                    {
                        "id": "node_id182",
                        "label": "Lieutenant",
                        "title": "Silver's associate who accompanies him with a flag of truce",
                        "size": 26
                    },
                    {
                        "id": "node_id183",
                        "label": "Dr. Livesey",
                        "title": "A member of the protagonists' group, assigned to watch the north side",
                        "size": 27
                    },
                    {
                        "id": "node_id184",
                        "label": "Jim",
                        "title": "A young member of the protagonists' group, assigned to watch the east side",
                        "size": 28
                    },
                    {
                        "id": "node_id185",
                        "label": "Gray",
                        "title": "A member of the protagonists' group, assigned to watch the west side",
                        "size": 27
                    },
                    {
                        "id": "node_id186",
                        "label": "Cap’n Smollett",
                        "title": "The captain of the protagonist group who engages in strategic discussions with Silver, also referred to as the Captain",
                        "size": 29
                    },
                    {
                        "id": "node_id187",
                        "label": "Dr. Livesey",
                        "title": "A prominent member of the protagonists who is involved in the strategic watch, same as Dr. Livesey mentioned earlier, integrated for summary purposes",
                        "size": 27
                    },
                    {
                        "id": "node_id188",
                        "label": "Ben Gunn",
                        "title": "A character referred to in retrospect for his actions against the pirates",
                        "size": 25
                    },
                    {
                        "id": "node_id189",
                        "label": "Abe Gray",
                        "title": "One of the captain's men whose name is invoked in a bluff by Silver",
                        "size": 26
                    }
                ],
                "edges": [
                    {
                        "id": "edge_id79",
                        "label": "instruct",
                        "title": "Captain instructed \"Doctor’s watch on the lookout. Dr. Livesey take the north side.\"",
                        "from": "node_id181",
                        "to": "node_id183",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id80",
                        "label": "instruct",
                        "title": "Captain instructed \"Jim, the east.\"",
                        "from": "node_id181",
                        "to": "node_id184",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id81",
                        "label": "instruct",
                        "title": "Captain instructed \"Gray, west.\"",
                        "from": "node_id181",
                        "to": "node_id185",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id82",
                        "label": "stand by",
                        "title": "Silver stood with his lieutenant in shadow.",
                        "from": "node_id180",
                        "to": "node_id182",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id83",
                        "label": "combination of multiple interactions",
                        "title": "Various interactions outlined above between Captain and Silver.",
                        "from": "node_id181",
                        "to": "node_id180",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id84",
                        "label": "combination of multiple interactions",
                        "title": "Various interactions outlined above between Silver and Captain.",
                        "from": "node_id180",
                        "to": "node_id181",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    }
                ]
            },
            {
                "sectionName": "4_6 title : 21 The Attack",
                "summary": "After observing a tense standoff where the captain criticized his men for not being at their posts, Captain Smollett fortified the blockhouse and prepared his crew for the imminent attack by pirates. Tensions rose as they waited in the heat, and eventually the pirates assaulted the blockhouse, with initial musket fire followed by a direct charge. Despite being outnumbered, the defenders managed to repel the first wave of the attack, suffering some casualties in the process. The captain was wounded, and the battle’s outcome left them in a slightly better position as the number of active mutineers diminished.",
                "nodes": [
                    {
                        "id": "node_id190",
                        "label": "Silver",
                        "title": "A one-legged pirate, often considered cunning and treacherous",
                        "size": 29
                    },
                    {
                        "id": "node_id191",
                        "label": "Captain (Captain Smollett)",
                        "title": "The captain of the ship and a natural leader, who directs the crew in defense tactics",
                        "size": 29
                    },
                    {
                        "id": "node_id192",
                        "label": "Gray",
                        "title": "A crew member loyal to the captain and noted for his duty and reliability",
                        "size": 27
                    },
                    {
                        "id": "node_id193",
                        "label": "Mr. Trelawney (Squire Trelawney)",
                        "title": "A squire involved in the events, known for his shooting skills",
                        "size": 28
                    },
                    {
                        "id": "node_id194",
                        "label": "Doctor (Dr. Livesey)",
                        "title": "A doctor who serves on the captain's side, important for his medical expertise and participation in defense",
                        "size": 28
                    },
                    {
                        "id": "node_id195",
                        "label": "Hunter",
                        "title": "A member of the captain's crew, takes orders about the defensive stance of the house",
                        "size": 26
                    },
                    {
                        "id": "node_id196",
                        "label": "Joyce",
                        "title": "A crew member who is attentive and acts according to the captain's orders",
                        "size": 26
                    },
                    {
                        "id": "node_id197",
                        "label": "Hawkins (referred to as \"I\")",
                        "title": "The story's protagonist, serves an assisting role in the defense, and is involved in the action",
                        "size": 29
                    },
                    {
                        "id": "node_id198",
                        "label": "Job Anderson",
                        "title": "The boatswain and a mutineer, he leads the pirate attack against the captain's crew",
                        "size": 27
                    },
                    {
                        "id": "node_id199",
                        "label": "The Doctor's assailant",
                        "title": "A pirate attacking the doctor during the battle, importance comes from his direct assault on one of the key defenders",
                        "size": 25
                    },
                    {
                        "id": "node_id200",
                        "label": "The man with the red night-cap",
                        "title": "A mutineer participating in the attack on the house, notable for his swift takeover attempt",
                        "size": 25
                    }
                ],
                "edges": []
            }
        ]
    },
    {
        "sectionName": "PART FIVE--My Sea Adventure",
        "subSection": [
            {
                "sectionName": "section5_1  title : 22 How My Sea Adventure Began",
                "summary": "After a fight, only three wounded men named Hunter, Captain Smollett, and a mutineer were alive, with Smollett expected to recover. The narrator envies Dr. Livesey, who left on an errand, suspected to meet Ben Gunn, and decides to embark on his own risky adventure. He steals biscuits and arms himself with pistols and plans to find Ben Gunn's hidden boat. He successfully finds the boat, a small handmade craft, and contemplates his next move: to release the anchored pirate ship, the Hispaniola, to strand the mutineers. As night falls, he prepares to execute his plan under the cover of darkness and fog.",
                "nodes": [
                    {
                        "id": "node_id201",
                        "label": "Captain Smollett",
                        "title": "The captain with grievous wounds but not fatally injured, expecting to recover",
                        "size": 27
                    },
                    {
                        "id": "node_id202",
                        "label": "Squire",
                        "title": "A character involved in cooking with others and consulting with Dr. Livesey",
                        "size": 26
                    },
                    {
                        "id": "node_id203",
                        "label": "Doctor Livesey",
                        "title": "A doctor and a responsible individual attending to patients and making key decisions",
                        "size": 28
                    },
                    {
                        "id": "node_id204",
                        "label": "Hunter",
                        "title": "A wounded man who never regains consciousness and dies",
                        "size": 25
                    },
                    {
                        "id": "node_id205",
                        "label": "Mutineer",
                        "title": "A pirate who dies from his injuries after Doctor Livesey's attempted surgery",
                        "size": 25
                    },
                    {
                        "id": "node_id206",
                        "label": "Anderson",
                        "title": "The person who shot Captain Smollett first mentioned by allusion",
                        "size": 24
                    },
                    {
                        "id": "node_id207",
                        "label": "Ben Gunn",
                        "title": "A person the narrator suspects Doctor Livesey has gone to see, indicated to have a hidden boat",
                        "size": 27
                    },
                    {
                        "id": "node_id208",
                        "label": "Gray",
                        "title": "A companion to the narrator, engaging in conversation and consulting",
                        "size": 26
                    },
                    {
                        "id": "node_id209",
                        "label": "Captain Flint",
                        "title": "A parrot associated with screaming and recognized by its plumage",
                        "size": 25
                    },
                    {
                        "id": "node_id210",
                        "label": "Silver",
                        "title": "A character recognized at a distance steering one of the gigs",
                        "size": 27
                    },
                    {
                        "id": "node_id211",
                        "label": "Man with the red cap",
                        "title": "A character seen by the narrator interacting with Silver, earlier spotted on the palisade",
                        "size": 26
                    }
                ],
                "edges": [
                    {
                        "id": "edge_id85",
                        "label": "wounded by",
                        "title": "Captain Smollett was wounded by a mutineer.",
                        "from": "node_id201",
                        "to": "node_id205",
                        "arrows": "to"
                    },
                    {
                        "id": "edge_id86",
                        "label": "died under the knife of",
                        "title": "The mutineer indeed died under the doctor’s knife.",
                        "from": "node_id205",
                        "to": "node_id203",
                        "arrows": "to"
                    },
                    {
                        "id": "edge_id87",
                        "label": "treated by and consultation with",
                        "title": "Captain Smollett's wounds were treated by Doctor Livesey and they had a consultation.",
                        "from": "node_id201",
                        "to": "node_id203",
                        "arrows": "to"
                    },
                    {
                        "id": "edge_id88",
                        "label": "went to see",
                        "title": "The doctor was going now to see Ben Gunn.",
                        "from": "node_id203",
                        "to": "node_id207",
                        "arrows": "to"
                    },
                    {
                        "id": "edge_id89",
                        "label": "helping with bandages",
                        "title": "The squire was helping Captain Smollett with his bandages.",
                        "from": "node_id202",
                        "to": "node_id201",
                        "arrows": "to"
                    },
                    {
                        "id": "edge_id90",
                        "label": "identified by",
                        "title": "Silver was identifiable and was accompanied by the man with the red cap.",
                        "from": "node_id210",
                        "to": "node_id211",
                        "arrows": "to"
                    }
                ]
            },
            {
                "sectionName": "5_2 title : 23 The Ebb-tide Runs",
                "summary": "The narrator recounts navigating a small, stubborn boat called a coracle toward a ship, the HISPANIOLA, using the tide to compensate for its poor handling. Despite challenges with the boat and deciding against cutting the ship's anchor, the narrator manages to get close to the vessel, overhearing drunken and angry voices from within. As the coracle reaches the ship, a confrontation aboard the HISPANIOLA distracts the watchmen, and the narrator witnesses a violent struggle between two men. The current shifts, carrying the coracle and the ship out toward the open sea, and the narrator prepares for what seems like an inevitable fatal outcome, eventually falling asleep in the bobbing vessel, dreaming of home.",
                "nodes": [
                    {
                        "id": "node_id212",
                        "label": "Ben Gunn",
                        "title": "A former member of Flint's crew who has admitted to difficulties handling the coracle",
                        "size": 26
                    },
                    {
                        "id": "node_id213",
                        "label": "Israel Hands",
                        "title": "Flint’s former gunner currently in the cabin of the HISPANIOLA drunk and quarreling",
                        "size": 26
                    },
                    {
                        "id": "node_id214",
                        "label": "Friend of the red night-cap",
                        "title": "An unidentified individual involved in a drunken quarrel with Israel Hands, likely another pirate",
                        "size": 25
                    },
                    {
                        "id": "node_id215",
                        "label": "Singing voice",
                        "title": "An unseen character singing a dreary sailor's song by the campfire",
                        "size": 24
                    },
                    {
                        "id": "node_id216",
                        "label": "Flint",
                        "title": "A notorious pirate captain mentioned in context with Israel Hands and the history of the HISPANIOLA crew",
                        "size": 25
                    },
                    {
                        "id": "node_id217",
                        "label": "Creator of the Home and the Old Admiral Benbow Dream",
                        "title": "Likely the narrator of the story dreaming of home, possibly Jim Hawkins",
                        "size": 27
                    }
                ],
                "edges": [
                    {
                        "id": "edge_id91",
                        "label": "confrontation",
                        "title": "Israel Hands and the friend of the red night-cap were locked together in a deadly wrestle.",
                        "from": "node_id213",
                        "to": "node_id214",
                        "arrows": "to"
                    },
                    {
                        "id": "edge_id92",
                        "label": "relation",
                        "title": "Israel Hands had been Flint's gunner in former days.",
                        "from": "node_id216",
                        "to": "node_id213",
                        "arrows": "to"
                    }
                ]
            },
            {
                "sectionName": "5_3 title : 24 The Cruise of the Coracle",
                "summary": "A man wakes up in a small boat near Treasure Island, contemplates landing but deems the cliffs and sea lions too dangerous. He decides to paddle towards a more inviting cape, battling waves and gaining confidence in maneuvering his coracle. He spots the ship HISPANIOLA sailing erratically and realizes no one is at the helm. He pursues the ship, braving the rough sea, until he manages to board the seemingly deserted vessel after a dangerous and strenuous chase.",
                "nodes": [
                    {
                        "id": "node_id218",
                        "label": "Coracle",
                        "title": "The small, lightweight boat that the protagonist navigates",
                        "size": 27
                    },
                    {
                        "id": "node_id219",
                        "label": "Spy-glass",
                        "title": "Reference to a hill that the protagonist sees upon awakening; not an acting character",
                        "size": 20
                    },
                    {
                        "id": "node_id220",
                        "label": "Sea lions",
                        "title": "Initially thought to be threatening creatures by the protagonist, later realized to be harmless",
                        "size": 24
                    },
                    {
                        "id": "node_id221",
                        "label": "Silver",
                        "title": "A character referenced by the protagonist as having given information about the current; likely an influential figure from earlier in the story",
                        "size": 26
                    },
                    {
                        "id": "node_id222",
                        "label": "Captain Smollett",
                        "title": "Implied to be a competent captain based on the protagonist's thoughts; not present in the current action but influential in background",
                        "size": 25
                    },
                    {
                        "id": "node_id223",
                        "label": "HISPANIOLA",
                        "title": "The ship the protagonist seeks to reach; personified slightly but not a character",
                        "size": 20
                    }
                ],
                "edges": [
                    {
                        "id": "edge_id93",
                        "label": "placed behind",
                        "title": "The sun was still hid from me behind the great bulk of the Spy-glass.",
                        "from": "node_id218",
                        "to": "node_id219",
                        "arrows": "to"
                    },
                    {
                        "id": "edge_id94",
                        "label": "observed by",
                        "title": "I beheld huge slimy monsters--soft snails, as it were, of incredible bigness--two or three score of them together, which I understood later to be sea lions.",
                        "from": "node_id218",
                        "to": "node_id220",
                        "arrows": "to"
                    },
                    {
                        "id": "edge_id95",
                        "label": "sighted by",
                        "title": "Right in front of me, not half a mile away, I beheld the HISPANIOLA under sail.",
                        "from": "node_id218",
                        "to": "node_id223",
                        "arrows": "to"
                    },
                    {
                        "id": "edge_id96",
                        "label": "associated with",
                        "title": "I could return the vessel to her captain, Captain Smollett.",
                        "from": "node_id222",
                        "to": "node_id223",
                        "arrows": "to"
                    }
                ]
            },
            {
                "sectionName": "5_4 title : 25 I Strike the Jolly Roger",
                "summary": "After gaining his footing on the ship during rough sailing conditions, the narrator finds himself alone on deck, encountering the badly injured Israel Hands and the dead body of another crewman, prompting him to seek brandy for Hands and provisions for himself. He successfully negotiates with Hands to sail the ship to a safer location, takes command of the vessel, lowers the pirate flag, and tends to Hands' wound with a handkerchief. With his new authority and improved spirits, they manage to navigate the ship closer to land as the narrator reflects on his actions and the suspicious behavior of Hands.",
                "nodes": [
                    {
                        "id": "node_id224",
                        "label": "Red-cap",
                        "title": "A deceased watchman",
                        "size": 24
                    },
                    {
                        "id": "node_id225",
                        "label": "Israel Hands",
                        "title": "A wounded and weakened shipmate",
                        "size": 28
                    },
                    {
                        "id": "node_id226",
                        "label": "Mr. Hands",
                        "title": "Same as Israel Hands, used by the narrator to sarcastically assert his own authority",
                        "size": 28
                    },
                    {
                        "id": "node_id227",
                        "label": "Captain Silver",
                        "title": "The absent figure of authority and power, symbolized by the flag that is taken down",
                        "size": 25
                    },
                    {
                        "id": "node_id228",
                        "label": "O’Brien",
                        "title": "The dead man noted for his Irish heritage",
                        "size": 24
                    },
                    {
                        "id": "node_id229",
                        "label": "Cap’n Hawkins",
                        "title": "The narrator, who has assumed command of the ship",
                        "size": 29
                    },
                    {
                        "id": "node_id230",
                        "label": "Captain Kidd",
                        "title": "Mentioned in passing as part of a location reference, not as significant as others",
                        "size": 22
                    },
                    {
                        "id": "node_id231",
                        "label": "Coxswain",
                        "title": "Unnamed character, likely Israel Hands, who the narrator observes derisively",
                        "size": 27
                    }
                ],
                "edges": [
                    {
                        "id": "edge_id97",
                        "label": "lying alongside",
                        "title": "Red-cap on his back alongside Israel Hands.",
                        "from": "node_id224",
                        "to": "node_id225",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id98",
                        "label": "witnessed",
                        "title": "Israel Hands witnessed Red-cap broken by an empty bottle (Note: We could generally consider this as a possible duplicate or reverse edge to the previous one, but for simplicity, we will keep it as they describe different situations).",
                        "from": "node_id225",
                        "to": "node_id224",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id99",
                        "label": "converses & strikes a bargain",
                        "title": "Mr. Hands converses with Cap’n Hawkins about taking possession of the ship. & Mr. Hands and Cap’n Hawkins strike a bargain regarding the navigation of the HISPANIOLA.",
                        "from": "node_id226",
                        "to": "node_id229",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id100",
                        "label": "mutual killing",
                        "title": "O’Brien and Israel Hands killed each other in their drunken wrath.",
                        "from": "node_id228",
                        "to": "node_id225",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id101",
                        "label": "aid",
                        "title": "Cap’n Hawkins aids Mr. Hands by binding his wound and giving him brandy.",
                        "from": "node_id229",
                        "to": "node_id226",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id102",
                        "label": "observes",
                        "title": "Cap’n Hawkins observes the Coxswain following him about the deck with a derisive smile.",
                        "from": "node_id229",
                        "to": "node_id231",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    }
                ]
            },
            {
                "sectionName": "5_5 title : 26 Israel Hands",
                "summary": "Israel Hands and the narrator, Jim Hawkins, are aboard the HISPANIOLA with Hands suggesting Jim throw the dead body of O'Brien overboard. Jim refuses, and they discuss the nature of death and spirits. Hands, pretending to want wine, tries to lure Jim away, ostensibly to fetch it. Jim, suspecting a trap, prepares to defend himself. Hands, secretly arming himself while pretending to be weak, attempts to attack Jim. They engage in a dangerous maneuver to beach the ship, with Jim narrowly escaping Hands’ attack by using quick thinking and agility. As the ship runs aground, both men are thrown into disarray, but Jim manages to outmaneuver Hands and gain the upper hand with loaded pistols. After a tense negotiation, Hands tries to surprise Jim but fails, resulting in his own fall into the water.",
                "nodes": [
                    {
                        "id": "node_id232",
                        "label": "Israel Hands",
                        "title": "The coxswain on the ship Hispaniola, involved in a tense and dangerous confrontation with the narrator",
                        "size": 29
                    },
                    {
                        "id": "node_id233",
                        "label": "Jim (Cap’n Hawkins)",
                        "title": "The narrator of the passage and a young crew member on the ship Hispaniola, playing a pivotal role in the power struggle with Israel Hands",
                        "size": 30
                    },
                    {
                        "id": "node_id234",
                        "label": "O’Brien",
                        "title": "A deceased shipmate mentioned as a subject in the conversation between Israel Hands and Jim",
                        "size": 21
                    }
                ],
                "edges": [
                    {
                        "id": "edge_id103",
                        "label": "consider throwing overboard",
                        "title": "Israel Hands suggests to Jim Hawkins that they could throw O’Brien overboard.",
                        "from": "node_id232",
                        "to": "node_id234",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id104",
                        "label": "not strong enough to throw overboard",
                        "title": "Jim tells Israel Hands he is not strong enough to throw O’Brien overboard and does not like the job.",
                        "from": "node_id233",
                        "to": "node_id234",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id105",
                        "label": "interact for different purposes",
                        "title": "Israel Hands interacts with Jim for different purposes: he asks Jim to get a bottle of wine under a pretext, reveals intent to harm him by arming himself with a knife, issues commands to navigate, plans to harm Jim with a dirk, proposes a truce after being bested, and attacks Jim with a surprise throw of the knife.",
                        "from": "node_id232",
                        "to": "node_id233",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id106",
                        "label": "react to attack AND harm",
                        "title": "Jim dodges an attack from Israel Hands and later is pinned by the shoulder to the mast by Israel Hands' knife throw.",
                        "from": "node_id233",
                        "to": "node_id232",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    }
                ]
            },
            {
                "sectionName": "5_6 title : 27 “Pieces of Eight”",
                "summary": "After witnessing the death of Hands and O'Brien and narrowly escaping with his life, the protagonist managed to tend to his injuries and secure the ship, the Hispaniola, from any remaining threats. He then ensures the safety of the ship by cutting the main-sail and makes his escape, wading ashore as the tide recedes. He sets off toward the stockade, reflecting on his adventures and anticipating the pride he'll take in telling his tale. However, as night falls, traveling becomes difficult, and the protagonist proceeds with caution. Upon nearing the stockade, he finds it strangely quiet, with a large fire indicating something amiss. Entering carefully, he is reassured to hear his companions snoring but criticizes their poor watch. When he accidentally announces his presence, Silver's parrot, Captain Flint, squawks loudly, awakening the men, leading to the protagonist's capture by Silver’s crew.",
                "nodes": [
                    {
                        "id": "node_id235",
                        "label": "Hands",
                        "title": "A member of the ship's crew who falls overboard and drowns",
                        "size": 25
                    },
                    {
                        "id": "node_id236",
                        "label": "O’Brien",
                        "title": "A dead man aboard the ship, presumably another crew member, disposed of by the narrator",
                        "size": 25
                    },
                    {
                        "id": "node_id237",
                        "label": "Ben Gunn",
                        "title": "A marooned individual encountered by the narrator",
                        "size": 26
                    },
                    {
                        "id": "node_id238",
                        "label": "Captain Smollett",
                        "title": "The captain of the narrator’s ship, not directly involved in the action but referenced",
                        "size": 26
                    },
                    {
                        "id": "node_id239",
                        "label": "Silver",
                        "title": "Leader of the buccaneers, also called Long John Silver, significant in the story's conflict",
                        "size": 28
                    },
                    {
                        "id": "node_id240",
                        "label": "Captain Flint",
                        "title": "Silver’s green parrot, known for repetitively squawking \"Pieces of eight!\"",
                        "size": 27
                    }
                ],
                "edges": []
            }
        ]
    },
    {
        "sectionName": "PART SIX--Captain Silver",
        "subSection": [
            {
                "sectionName": "section6_1  title : 28 In the Enemy’s Camp",
                "summary": "The protagonist, Jim Hawkins, finds himself in the blockhouse among the pirates who have taken control. The group includes the wounded man from the previous attack and Long John Silver with his parrot. Silver, appearing battle-worn but composed, talks to Jim in a seemingly friendly manner, despite the precarious situation. Jim silently observes as Silver tells how his group lost the ship after a negotiation with Dr. Livesey. Although Jim’s friends were safe and he was being offered a chance to join the pirates, he bravely confronts Silver, claiming responsibility for their misfortunes, from overhearing their plans to his direct actions against them. Silver admires Jim’s courage and commands his crew's respect, defying anyone to challenge him. As the crew leaves for a private council, Silver confides in Jim that they are both in danger but proposes mutual support. Jim tentatively agrees, recognizing their fates are intertwined. Silver then questions Jim about the chart and the doctor’s intent, concluding there must be more to the situation as he braces for additional trouble.",
                "nodes": [
                    {
                        "id": "node_id241",
                        "label": "Jim Hawkins",
                        "title": "The protagonist and narrator of the story, a young boy who finds himself in the middle of a treacherous adventure with pirates",
                        "size": 29
                    },
                    {
                        "id": "node_id242",
                        "label": "Captain Silver",
                        "title": "Also known as \"Long John Silver\", the cunning and charming one-legged pirate, antagonist of the story and leader of the pirates",
                        "size": 29
                    },
                    {
                        "id": "node_id243",
                        "label": "Tom Morgan",
                        "title": "A pirate and one of Long John Silver's crew members, a minor character but involved in the pirate's mutiny",
                        "size": 23
                    },
                    {
                        "id": "node_id244",
                        "label": "Captain Smollett",
                        "title": "The honorable and disciplined captain of the voyage, a figure of authority and integrity, absence mentioned",
                        "size": 26
                    },
                    {
                        "id": "node_id245",
                        "label": "Doctor Livesey",
                        "title": "A doctor and one of the leaders of the honest party against the pirates, skilled and resourceful, only referred to in the story",
                        "size": 26
                    },
                    {
                        "id": "node_id246",
                        "label": "Dick",
                        "title": "A young pirate and crew member, minor character",
                        "size": 22
                    },
                    {
                        "id": "node_id247",
                        "label": "Parrot",
                        "title": "Long John Silver's parrot, a minor but iconic presence in the story, often repeating phrases like \"Pieces of eight!\"",
                        "size": 22
                    },
                    {
                        "id": "node_id248",
                        "label": "The pirates (as a group)",
                        "title": "The group of buccaneers following Long John Silver, their actions drive much of the plot",
                        "size": 28
                    },
                    {
                        "id": "node_id249",
                        "label": "The man with the blood-stained bandage",
                        "title": "A wounded pirate, likely one previously injured during the story",
                        "size": 21
                    },
                    {
                        "id": "node_id250",
                        "label": "Black Dog",
                        "title": "A pirate who previously appeared in the story, not directly in this extract but referenced",
                        "size": 23
                    },
                    {
                        "id": "node_id251",
                        "label": "Billy Bones",
                        "title": "A former pirate, the original owner of the treasure map, mentioned in relation to past events",
                        "size": 24
                    },
                    {
                        "id": "node_id252",
                        "label": "Hands",
                        "title": "A pirate mentioned in Jim's speech, considered dead and not directly active in this extract",
                        "size": 21
                    },
                    {
                        "id": "node_id253",
                        "label": "O’Brien",
                        "title": "A pirate mentioned by Silver, presumed to have turned against their treacherous plans, not directly active in this extract",
                        "size": 21
                    },
                    {
                        "id": "node_id254",
                        "label": "The old mahogany-faced seaman (Morgan)",
                        "title": "Prospectively the same as Tom Morgan, mentioned in connection with recognizing Black Dog",
                        "size": 23
                    }
                ],
                "edges": [
                    {
                        "id": "edge_id107",
                        "label": "offer",
                        "title": "Captain Silver offered Jim Hawkins to join his crew and shared his opinion about Captain Smollett and Doctor Livesey.",
                        "from": "node_id242",
                        "to": "node_id241",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id108",
                        "label": "plea",
                        "title": "Jim Hawkins asked Captain Silver to let the doctor know his regards if things went to the worst.",
                        "from": "node_id241",
                        "to": "node_id242",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id109",
                        "label": "support",
                        "title": "The old mahogany-faced seaman (Morgan) expressed support for Jim Hawkins.",
                        "from": "node_id254",
                        "to": "node_id241",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id110",
                        "label": "challenge",
                        "title": "Jim Hawkins boldly revealed his actions and took credit for the troubles that befell the pirates.",
                        "from": "node_id241",
                        "to": "node_id248",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id111",
                        "label": "threaten",
                        "title": "Captain Silver threatened Tom Morgan with severe consequences if he crossed him.",
                        "from": "node_id242",
                        "to": "node_id243",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id112",
                        "label": "confront",
                        "title": "Tom Morgan drew his knife and was prepared to confront Captain Silver.",
                        "from": "node_id243",
                        "to": "node_id242",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    }
                ]
            },
            {
                "sectionName": "6_2 title : 29 The Black Spot Again",
                "summary": "The buccaneers convened, and John Silver was presented with the black spot, signaling his deposal as captain. They accused him of mishandling their quest, but Silver eloquently defended himself, managing to retain support from his crew. The meeting concluded with Silver avoiding immediate repercussion and assigning George Merry as sentinel. Meanwhile, I struggled with my own dangerous predicament, Silver’s crafty tactics, and my conscience over a recent killing, while Silver seemingly slept without worry despite his precarious situation.",
                "nodes": [
                    {
                        "id": "node_id255",
                        "label": "Silver",
                        "title": "A sea-cook and leader among the buccaneers; clever and manipulative",
                        "size": 29
                    },
                    {
                        "id": "node_id256",
                        "label": "Jim",
                        "title": "The narrator of the story; a young boy involved with the buccaneers",
                        "size": 28
                    },
                    {
                        "id": "node_id257",
                        "label": "George",
                        "title": "A mutineer with knowledge of the crew's rules; challenges Silver's authority",
                        "size": 27
                    },
                    {
                        "id": "node_id258",
                        "label": "Morgan",
                        "title": "Another buccaneer who supports Silver; remarks on the bad luck of using a Bible page for the black spot",
                        "size": 26
                    },
                    {
                        "id": "node_id259",
                        "label": "Dick",
                        "title": "A member of the buccaneers implicated in cutting the Bible page; considered unlucky by the crew",
                        "size": 26
                    },
                    {
                        "id": "node_id260",
                        "label": "The emissary",
                        "title": "A member of the buccaneers who temporarily leaves during the meeting to ask for a torch",
                        "size": 25
                    },
                    {
                        "id": "node_id261",
                        "label": "The kneeling figure",
                        "title": "A buccaneer involved in a ritual with a knife and book; his actions draw Jim's attention",
                        "size": 25
                    },
                    {
                        "id": "node_id262",
                        "label": "The long man with yellow eyes",
                        "title": "A distinctive member of the buccaneers who insists on procedure during the council",
                        "size": 26
                    },
                    {
                        "id": "node_id263",
                        "label": "Anderson",
                        "title": "Mentioned by Silver as one who opposed him and tipped him with the black spot",
                        "size": 25
                    },
                    {
                        "id": "node_id264",
                        "label": "Hands",
                        "title": "Mentioned by Silver as one who opposed him; contributed to the crew's troubles",
                        "size": 25
                    }
                ],
                "edges": [
                    {
                        "id": "edge_id113",
                        "label": "inform",
                        "title": "Silver informed Jim about the breeze coming.",
                        "from": "node_id255",
                        "to": "node_id256",
                        "arrows": "to"
                    }
                ]
            },
            {
                "sectionName": "6_3 title : 30 On Parole",
                "summary": "Dr. Livesey visits the blockhouse to treat the sick pirates, exhibiting confidence and control despite the danger. Silver, maintaining authority over the mutinous crew, negotiates with Livesey, allowing him to speak with Jim Hawkins outside the stockade. During their conversation, Silver displays vulnerability about his predicament. Jim reveals to Livesey the ship's hidden location, prompting a discussion of the dire situation and future risks. Livesey offers Silver hope and protection in exchange for keeping Jim safe. He departs to seek further assistance, leaving Silver and Jim in a tense situation with the pirates.",
                "nodes": [
                    {
                        "id": "node_id265",
                        "label": "Dr. Livesey",
                        "title": "A skilled and caring physician, central to the plot of \"Treasure Island\"",
                        "size": 29
                    },
                    {
                        "id": "node_id266",
                        "label": "Jim Hawkins",
                        "title": "The young protagonist and narrator of \"Treasure Island\", central to the story's progression and development",
                        "size": 30
                    },
                    {
                        "id": "node_id267",
                        "label": "Long John Silver",
                        "title": "A complex character, sometimes a villain and other times an ally. Plays a crucial role due to his knowledge of the treasure and relationships with other characters",
                        "size": 29
                    },
                    {
                        "id": "node_id268",
                        "label": "George Merry",
                        "title": "A minor character, a member of Silver's crew, involved in the mutiny",
                        "size": 23
                    },
                    {
                        "id": "node_id269",
                        "label": "Morgan",
                        "title": "A member of Long John Silver’s pirate crew and a minor character in the story",
                        "size": 22
                    },
                    {
                        "id": "node_id270",
                        "label": "Dick",
                        "title": "A young pirate who is a part of Silver’s crew",
                        "size": 22
                    },
                    {
                        "id": "node_id271",
                        "label": "Squire",
                        "title": "Mentioned in context but not featured directly in the action, adds to character dynamics and is a part of the background narrative structure",
                        "size": 24
                    },
                    {
                        "id": "node_id272",
                        "label": "Captain Smollett",
                        "title": "The captain of the voyage, mentioned, but not present in the scene, affects the narrative through past actions and reputation",
                        "size": 25
                    },
                    {
                        "id": "node_id273",
                        "label": "Ben Gunn",
                        "title": "Mentioned by Dr. Livesey, a former pirate now living on the island. His previous actions have a significant impact on the story",
                        "size": 25
                    }
                ],
                "edges": [
                    {
                        "id": "edge_id114",
                        "label": "remember/discuss/concern",
                        "title": "Dr. Livesey remembered Jim Hawkins with confusion/Dr. Livesey said he wished to have a talk with Jim Hawkins/Dr. Livesey expressed his concern for Jim Hawkins' actions.",
                        "from": "node_id265",
                        "to": "node_id266",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id115",
                        "label": "call/agree",
                        "title": "Silver called out to Dr. Livesey saying \"You, doctor! Top o' the morning to you, sir!\"/Silver agreed to Dr. Livesey's request to speak with Jim Hawkins.",
                        "from": "node_id267",
                        "to": "node_id265",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id116",
                        "label": "instruct",
                        "title": "Silver instructed George Merry to help Dr. Livesey over the ship's side.",
                        "from": "node_id267",
                        "to": "node_id268",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id117",
                        "label": "object",
                        "title": "George Merry objected to Dr. Livesey's proposal to speak with Jim Hawkins.",
                        "from": "node_id268",
                        "to": "node_id265",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id118",
                        "label": "promise",
                        "title": "Silver made Jim Hawkins promise not to escape.",
                        "from": "node_id267",
                        "to": "node_id266",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    },
                    {
                        "id": "edge_id119",
                        "label": "inform",
                        "title": "Jim Hawkins informed Dr. Livesey about the ship's location.",
                        "from": "node_id266",
                        "to": "node_id265",
                        "arrows": "to",
                        "smooth": {
                            "type": "curvedCW",
                            "roundness": 0.3
                        }
                    }
                ]
            },
            {
                "sectionName": "6_4 title : 31 The Treasure-hunt--Flint’s Pointer",
                "summary": "Silver and Jim discuss their mutual life-saving actions and plan to stick together during the treasure hunt. The crew is carelessly wasting food and Silver is the de facto leader, instilling confidence in his men regarding the treasure quest and control of the ship. Jim is anxious about the pirates’ recklessness and Silver's double-dealing nature. Despite Silver's alliances, there's fear about the outcome if the crew's trust in him falters. The expedition for Flint's treasure begins with a lively departure but turns tense when discovering a skeleton positioned as a pointer towards the treasure, evoking dread of Flint's ghost among the men.",
                "nodes": [
                    {
                        "id": "node_id274",
                        "label": "Jim Hawkins",
                        "title": "The protagonist and narrator of the story",
                        "size": 30
                    },
                    {
                        "id": "node_id275",
                        "label": "Long John Silver",
                        "title": "A cunning and charismatic pirate, also called \"Barbecue\" or just \"Silver\"",
                        "size": 29
                    },
                    {
                        "id": "node_id276",
                        "label": "Captain Flint",
                        "title": "Silver's parrot, named after the infamous pirate captain",
                        "size": 23
                    },
                    {
                        "id": "node_id277",
                        "label": "Dr. Livesey",
                        "title": "The local doctor and magistrate, wise and practical",
                        "size": 27
                    },
                    {
                        "id": "node_id278",
                        "label": "George Merry",
                        "title": "One of the mutineers who questions Silver's authority",
                        "size": 25
                    },
                    {
                        "id": "node_id279",
                        "label": "Tom Morgan",
                        "title": "Another member of Silver's crew, recalls someone named Allardyce",
                        "size": 24
                    },
                    {
                        "id": "node_id280",
                        "label": "Billy Bones",
                        "title": "The old sea captain who dies in the Admiral Benbow inn, mentioned retrospectively by Morgan",
                        "size": 23
                    },
                    {
                        "id": "node_id281",
                        "label": "Allardyce",
                        "title": "A crew member presumably killed by Captain Flint, remembered for his unpaid debt",
                        "size": 22
                    }
                ],
                "edges": []
            },
            {
                "sectionName": "6_5 title : 32 The Treasure-hunt--The Voice Among the Trees",
                "summary": "While the party rests, Silver takes compass bearings, and the pirates are spooked by a mysterious voice singing \"Fifteen men on the dead man’s chest.” Initially feared to be the ghost of Flint, the voice is revealed to be Ben Gunn’s. Their spirits lifted, they ignore Dick's growing illness and press on. They reach a thicket and find that the treasure has already been excavated and stolen, confirmed by the presence of the name WALRUS on a board from Flint's ship.",
                "nodes": [
                    {
                        "id": "node_id282",
                        "label": "Silver",
                        "title": "A pirate and significant character who is involved in the treasure hunt and shows courage and leadership",
                        "size": 28
                    },
                    {
                        "id": "node_id283",
                        "label": "Morgan",
                        "title": "A pirate who is affected by thoughts of Flint and participates in the treasure hunt",
                        "size": 26
                    },
                    {
                        "id": "node_id284",
                        "label": "Flint",
                        "title": "A deceased pirate referred to by the others, instilling fear with the mention of his name",
                        "size": 27
                    },
                    {
                        "id": "node_id285",
                        "label": "Merry",
                        "title": "A pirate who reacts strongly to the mysterious voice and later rationalizes the situation",
                        "size": 26
                    },
                    {
                        "id": "node_id286",
                        "label": "The Singer",
                        "title": "An unseen character whose singing affects the pirates, possibly the spirit of Flint or someone mimicking Flint's voice",
                        "size": 25
                    },
                    {
                        "id": "node_id287",
                        "label": "Darby M'Graw",
                        "title": "A name called out by the mysterious singer, possibly a reference to a person from the past of the pirates",
                        "size": 24
                    },
                    {
                        "id": "node_id288",
                        "label": "George Merry",
                        "title": "One of the pirates who finds reassurance in Silver's logic about spirits and echoes",
                        "size": 26
                    },
                    {
                        "id": "node_id289",
                        "label": "Ben Gunn",
                        "title": "The presumed singer who mimics Flint's voice and is recognized by the pirates",
                        "size": 27
                    },
                    {
                        "id": "node_id290",
                        "label": "Dick",
                        "title": "A young pirate who prays out of fear and is possibly falling sick due to fever and exhaustion",
                        "size": 26
                    },
                    {
                        "id": "node_id291",
                        "label": "John (Silver)",
                        "title": "Also known as Silver, his name mentioned as he encourages his followers",
                        "size": 28
                    },
                    {
                        "id": "node_id292",
                        "label": "The Buccaneer with the Blue Face",
                        "title": "A reference to a past buccaneer who killed his accomplices, causing fear when recalled",
                        "size": 25
                    }
                ],
                "edges": [
                    {
                        "id": "edge_id120",
                        "label": "think about & mistake voice for",
                        "title": "Morgan was thinking of Flint which affected him negatively and mistaken the singing voice for Flint.",
                        "from": "node_id283",
                        "to": "node_id284",
                        "arrows": "to"
                    },
                    {
                        "id": "edge_id121",
                        "label": "warn",
                        "title": "Merry warned Silver not to cross a spirit.",
                        "from": "node_id285",
                        "to": "node_id291",
                        "arrows": "to"
                    },
                    {
                        "id": "edge_id122",
                        "label": "be convinced by",
                        "title": "George Merry was convinced by Silver's argument about the echo.",
                        "from": "node_id288",
                        "to": "node_id291",
                        "arrows": "to"
                    },
                    {
                        "id": "edge_id123",
                        "label": "joke with",
                        "title": "Silver joked with Dick about his precautions with the Bible.",
                        "from": "node_id282",
                        "to": "node_id290",
                        "arrows": "to"
                    }
                ]
            },
            {
                "sectionName": "6_6 title : 33 The Fall of a Chieftain",
                "summary": "After a tense confrontation between Silver and the mutineers over gold, shots fire from an ambush by the doctor and others, causing the mutineers to flee. Silver and Jim then join the doctor and head to the boats, with Silver working hard despite his exhaustion. They learn Ben Gunn had found the treasure long ago, and they maneuver to protect it. Eventually, they reach the safety of the anchored Hispaniola and celebrate their hard-won success, acknowledging the heavy costs of their adventure.",
                "nodes": [
                    {
                        "id": "node_id293",
                        "label": "Silver",
                        "title": "A seaman with a crutch who is cunning and adaptive, showing leadership and an opportunistic nature",
                        "size": 28
                    },
                    {
                        "id": "node_id294",
                        "label": "Jim",
                        "title": "The protagonist and first-person narrator, often finding himself in precarious situations, demonstrating bravery and resourcefulness",
                        "size": 29
                    },
                    {
                        "id": "node_id295",
                        "label": "Morgan",
                        "title": "A buccaneer who discovers a piece of gold during the treasure hunt, a minor character involved in the events",
                        "size": 24
                    },
                    {
                        "id": "node_id296",
                        "label": "Merry",
                        "title": "A buccaneer who challenges Silver and later falls in the excavation, instigating the divide between the group",
                        "size": 26
                    },
                    {
                        "id": "node_id297",
                        "label": "The man with the bandage",
                        "title": "An unnamed buccaneer who dies after musket shots are fired, has a minor role but his death showcases the turn of events",
                        "size": 23
                    },
                    {
                        "id": "node_id298",
                        "label": "Long John",
                        "title": "Presumably another name for Silver, emphasized by his use of crutch and leadership position",
                        "size": 28
                    },
                    {
                        "id": "node_id299",
                        "label": "Ben Gunn",
                        "title": "The maroon who found Flint's treasure and had a notable role in protecting the treasure, characterized as slightly odd but crucial",
                        "size": 28
                    },
                    {
                        "id": "node_id300",
                        "label": "Dr. Livesey",
                        "title": "Likely a voice of authority and reason within the group, has medical knowledge, played a pivotal role in the battle and strategic moves",
                        "size": 27
                    },
                    {
                        "id": "node_id301",
                        "label": "Gray",
                        "title": "A member of the party, assisting Dr. Livesey and likely involved in tactical actions, less is known about him",
                        "size": 25
                    },
                    {
                        "id": "node_id302",
                        "label": "Squire",
                        "title": "Has a supervisory role, indicates social status, interacts with Silver revealing tensions, his authority is acknowledged throughout the group",
                        "size": 27
                    },
                    {
                        "id": "node_id303",
                        "label": "Captain Smollett",
                        "title": "Injured yet still an authority figure, likely a seasoned leader, has the respect of the crew and Jim",
                        "size": 27
                    },
                    {
                        "id": "node_id304",
                        "label": "Flint",
                        "title": "The previous owner of the treasure, never appears directly yet his influence persists throughout the plot",
                        "size": 26
                    }
                ],
                "edges": [
                    {
                        "id": "edge_id124",
                        "label": "pass weapon & regretful",
                        "title": "Silver passed Jim a double-barrelled pistol & Silver expressed his regret regarding past actions.",
                        "from": "node_id293",
                        "to": "node_id294",
                        "arrows": "to"
                    },
                    {
                        "id": "edge_id125",
                        "label": "taunt & acknowledge ambition",
                        "title": "Merry taunted Silver by shaking a two-guinea piece at him & Silver remarked on Merry's ambition to be captain.",
                        "from": "node_id293",
                        "to": "node_id296",
                        "arrows": "to"
                    },
                    {
                        "id": "edge_id126",
                        "label": "kill",
                        "title": "Long John shot Merry with two barrels of a pistol.",
                        "from": "node_id298",
                        "to": "node_id296",
                        "arrows": "to"
                    },
                    {
                        "id": "edge_id127",
                        "label": "meet",
                        "title": "Ben Gunn and Silver met after the shoot-out.",
                        "from": "node_id299",
                        "to": "node_id293",
                        "arrows": "to"
                    },
                    {
                        "id": "edge_id128",
                        "label": "guard",
                        "title": "The squire was left to guard Captain Smollett.",
                        "from": "node_id302",
                        "to": "node_id303",
                        "arrows": "to"
                    },
                    {
                        "id": "edge_id129",
                        "label": "challenged",
                        "title": "Silver was challenged by the squire who called him a prodigious villain and impostor.",
                        "from": "node_id293",
                        "to": "node_id302",
                        "arrows": "to"
                    },
                    {
                        "id": "edge_id130",
                        "label": "compliment",
                        "title": "Captain Smollett called Jim a good boy in his line.",
                        "from": "node_id303",
                        "to": "node_id294",
                        "arrows": "to"
                    }
                ]
            },
            {
                "sectionName": "6_7 title : 34 And Last",
                "summary": "The group is engaged in the laborious task of moving a large hoard of treasure to their ship, the Hispaniola, while keeping an eye on the remaining mutineers on the island. As they continue their work, they encounter various challenges and interactions with the mutineers. They ultimately decide to abandon the mutineers on the island, leaving them supplies and sailing away. During their escape, one of the mutineers shoots at them, but they leave without further incident. They reach a Spanish port, where part of the crew goes ashore and experiences a pleasant evening. Later, they learn that Silver has escaped with a portion of the treasure. The crew returns to Bristol with a fraction of its original members, and each person goes on to lead their own life post-adventure, with varying outcomes based on their choices and desires. Silver's eventual fate remains unknown, and the bulk of the treasure remains buried on the island.",
                "nodes": [
                    {
                        "id": "node_id305",
                        "label": "The next morning",
                        "title": "A character in the story performing tasks related to gold transportation",
                        "size": 21
                    },
                    {
                        "id": "node_id306",
                        "label": "The three fellows",
                        "title": "Characters still abroad on the island, considered a minor threat",
                        "size": 23
                    },
                    {
                        "id": "node_id307",
                        "label": "A single sentry",
                        "title": "Character ensuring protection against sudden attacks",
                        "size": 21
                    },
                    {
                        "id": "node_id308",
                        "label": "Gray",
                        "title": "A workman involved in the transportation of treasure",
                        "size": 25
                    },
                    {
                        "id": "node_id309",
                        "label": "Ben Gunn",
                        "title": "A character involved in the transportation of treasure, closely involved with Silver",
                        "size": 26
                    },
                    {
                        "id": "node_id310",
                        "label": "Silver",
                        "title": "A complex character with a background of mutiny, showing loyalty and ingratiating behavior",
                        "size": 28
                    },
                    {
                        "id": "node_id311",
                        "label": "The doctor",
                        "title": "A central character expressing concern for the mutineers' wellbeing, involved in decision making",
                        "size": 27
                    },
                    {
                        "id": "node_id312",
                        "label": "The three surviving mutineers",
                        "title": "Characters stranded on the island, responsible for a shot at Silver",
                        "size": 25
                    },
                    {
                        "id": "node_id313",
                        "label": "The captain",
                        "title": "A leader giving orders despite being unwell, involved in escape from the island",
                        "size": 26
                    },
                    {
                        "id": "node_id314",
                        "label": "Captain Smollett",
                        "title": "Now retired from the sea, previously a central figure",
                        "size": 24
                    },
                    {
                        "id": "node_id315",
                        "label": "Captain Flint",
                        "title": "An unseen character influencing events through legacy",
                        "size": 22
                    }
                ],
                "edges": [
                    {
                        "id": "edge_id131",
                        "label": "skepticism",
                        "title": "The doctor responded to Silver with skepticism.",
                        "from": "node_id311",
                        "to": "node_id310",
                        "arrows": "to"
                    },
                    {
                        "id": "edge_id132",
                        "label": "assist",
                        "title": "The doctor expressed his willingness to assist The three surviving mutineers.",
                        "from": "node_id311",
                        "to": "node_id312",
                        "arrows": "to"
                    },
                    {
                        "id": "edge_id133",
                        "label": "shot over",
                        "title": "One of the three surviving mutineers sent a shot over Silver’s head and through The captain's main-sail.",
                        "from": "node_id313",
                        "to": "node_id310",
                        "arrows": "to"
                    }
                ]
            }
        ]
    }
]